org/links.org
* Monthly Links

This page is mostly a log in which I keep links to things I've read,
made, done, etc. It's separated by month, along with my goals for the
next month, and should be end up being in reverse chronological order

** 2019
*** January 2019
**** Goals for February
     - *Decide which project to tackle next, begin working* I'm bouncing around a couple of fun ideas so I need to pick one; I'll probably end up picking the one that ends up the more technically challenging, for obvious reasons.
     - *Spend some time on organization* I've let my organization escape me a little bit so it'll be good to spend a little time to get everything back in place.
     - *Nail down some IRL goals this month*
**** Things I've Made
     - [[http://planetbanatt.net/articles/personainsmash.html][Predicting Personality with Playstyle in Super Smash Brothers]] People have been kicking around this question for ages so I did some research to get to the bottom of it. I opened the survey on January 8th, closed the survey on January 10th and began writing, and then posted this essay on January 18th, which means I turned around this project in roughly one week which I'm very proud of. 

**** Things I've Consumed
     - [[https://www.youtube.com/watch?v%3DGyUcwsjyd8Q][OCARINA OF TIME - A Masterclass in Subtext]] A documentary about subtext in OoT; one of the most well-edited and moving pieces of content I've seen in so, so long. Sort of like my [[http://planetbanatt.net/articles/pingpongzen.html][Ping Pong essay]] but so well crafted that I got self conscious thinking about my own content.
     - [[https://www.youtube.com/watch?v%3DHEfHFsfGXjs][The most unexpected answer to a counting puzzle]] 3Blue1Brown really hits it out of the park with this video, one of the weirdest math problems I've ever seen in my entire life. [[https://www.youtube.com/watch?v%3DjsYwFizhncE][Answer]]. [[https://www.youtube.com/watch?v%3DbrU5yLm9DZM][Answer 2]].
     - [[https://www.youtube.com/watch?v%3DXbNWFQ4jqpQ][Bob$ on Crush vs lloD]] one of the best SSBM analysis videos I've seen in some time.


** 2018

*** December 2018
**** Goals for December
     - *Resume Reading* as I completely and abruptly stopped reading in favor of working on the Homestuck project
     - *Enroll in an online class* since my younger brother got this for me for christmas, have to decide what I want to take, though
     - *Practice a bit for Genesis 6*

