links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>links</title>
<!-- 2019-02-09 Sat 21:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ambi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">links</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Monthly Links</a>
<ul>
<li><a href="#sec-1-1">2019</a>
<ul>
<li><a href="#sec-1-1-1">January 2019</a>
<ul>
<li><a href="#sec-1-1-1-1">Goals for February</a></li>
<li><a href="#sec-1-1-1-2">Things I've Made</a></li>
<li><a href="#sec-1-1-1-3">Things I've Consumed</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2">2018</a>
<ul>
<li><a href="#sec-1-2-1">December 2018</a>
<ul>
<li><a href="#sec-1-2-1-1">Goals for December</a></li>
<li><a href="#sec-1-2-1-2">Things I've Made</a></li>
<li><a href="#sec-1-2-1-3">Things I've Consumed</a></li>
<li><a href="#sec-1-2-1-4">Reflections</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2">November 2018</a>
<ul>
<li><a href="#sec-1-2-2-1">Brief Updates</a></li>
<li><a href="#sec-1-2-2-2">Goals for December</a></li>
<li><a href="#sec-1-2-2-3">Things I've Made</a></li>
<li><a href="#sec-1-2-2-4">Things I've Consumed</a>
<ul>
<li><a href="#sec-1-2-2-4-1">Papers</a></li>
<li><a href="#sec-1-2-2-4-2">Videos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-3">October 2018</a>
<ul>
<li><a href="#sec-1-2-3-1">Brief Updates</a></li>
<li><a href="#sec-1-2-3-2">Goals for November</a></li>
<li><a href="#sec-1-2-3-3">Things I've made</a></li>
<li><a href="#sec-1-2-3-4">Things I've consumed</a>
<ul>
<li><a href="#sec-1-2-3-4-1">Games</a></li>
<li><a href="#sec-1-2-3-4-2">Video</a></li>
<li><a href="#sec-1-2-3-4-3">Books</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-4">September 2018</a>
<ul>
<li><a href="#sec-1-2-4-1">Goals for October</a></li>
<li><a href="#sec-1-2-4-2">Things I've Made</a></li>
<li><a href="#sec-1-2-4-3">Things I've Consumed</a></li>
</ul>
</li>
<li><a href="#sec-1-2-5">August 2018</a>
<ul>
<li><a href="#sec-1-2-5-1">Brief Updates</a></li>
<li><a href="#sec-1-2-5-2">Goals for September</a></li>
<li><a href="#sec-1-2-5-3">Things I've Made</a>
<ul>
<li><a href="#sec-1-2-5-3-1">Videos</a></li>
</ul>
</li>
<li><a href="#sec-1-2-5-4">Things I've Consumed</a>
<ul>
<li><a href="#sec-1-2-5-4-1">Web</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-6">July 2018</a>
<ul>
<li><a href="#sec-1-2-6-1">Brief Updates</a></li>
<li><a href="#sec-1-2-6-2">Goals for August</a></li>
<li><a href="#sec-1-2-6-3">Things I've Made</a></li>
<li><a href="#sec-1-2-6-4">Things I've Consumed</a>
<ul>
<li><a href="#sec-1-2-6-4-1">Web</a></li>
<li><a href="#sec-1-2-6-4-2">Video</a></li>
<li><a href="#sec-1-2-6-4-3">Books</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-7">June 2018</a>
<ul>
<li><a href="#sec-1-2-7-1">Goals for July</a></li>
<li><a href="#sec-1-2-7-2">Things I have Made</a></li>
<li><a href="#sec-1-2-7-3">Things I have Consumed</a></li>
</ul>
</li>
<li><a href="#sec-1-2-8">May 2018</a>
<ul>
<li><a href="#sec-1-2-8-1">Goals for June</a></li>
<li><a href="#sec-1-2-8-2">Things I have Made</a></li>
<li><a href="#sec-1-2-8-3">Things I have Consumed</a></li>
</ul>
</li>
<li><a href="#sec-1-2-9">April 2018</a>
<ul>
<li><a href="#sec-1-2-9-1">Goals for May</a></li>
<li><a href="#sec-1-2-9-2">Things I have Made</a>
<ul>
<li><a href="#sec-1-2-9-2-1">Videos</a></li>
</ul>
</li>
<li><a href="#sec-1-2-9-3">Things I have Consumed</a>
<ul>
<li><a href="#sec-1-2-9-3-1">Articles</a></li>
<li><a href="#sec-1-2-9-3-2">References</a></li>
<li><a href="#sec-1-2-9-3-3">Videos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#march">March 2018</a>
<ul>
<li><a href="#goalsforapril">Goals for April</a></li>
<li><a href="#updates">Updates</a></li>
<li><a href="#thingsivemade">Things I've made</a>
<ul>
<li><a href="#writing">Writing</a></li>
</ul>
</li>
<li><a href="#thingsiveconsumed">Things I've consumed</a>
<ul>
<li><a href="#books">Books</a></li>
<li><a href="#articles">Articles</a></li>
<li><a href="#videos">Videos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#february">February 2018</a>
<ul>
<li><a href="#goalsformarch">Goals for March</a></li>
<li><a href="#updates">Updates</a></li>
<li><a href="#stuffivemade">Stuff I've made</a>
<ul>
<li><a href="#articles">Articles</a></li>
<li><a href="#videos">Videos</a></li>
</ul>
</li>
<li><a href="#stuffiveconsumed">Stuff I've Consumed</a>
<ul>
<li><a href="#books">Books</a>
<ul>
<li><a href="#articles-1">Articles</a></li>
</ul>
</li>
<li><a href="#videos-1">Videos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-12">January 2018</a>
<ul>
<li><a href="#goalsforfebruary">Goals for February</a></li>
<li><a href="#updates">Updates</a></li>
<li><a href="#stuffivemade">Stuff I've Made</a>
<ul>
<li><a href="#writing">Writing</a></li>
<li><a href="#images">Images</a></li>
</ul>
</li>
<li><a href="#stuffiveconsumed">Stuff I've consumed</a>
<ul>
<li><a href="#papers">Papers</a></li>
<li><a href="#books">Books</a></li>
<li><a href="#media">Media</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#section">2017</a>
<ul>
<li><a href="#yearend2017">Year End 2017</a>
<ul>
<li><a href="#goalsforjanuary">Goals for January</a></li>
<li><a href="#stuffivemade">Stuff I've Made</a>
<ul>
<li><a href="#writing">Writing</a></li>
<li><a href="#videos">Videos</a></li>
<li><a href="#images">Images</a></li>
</ul>
</li>
<li><a href="#stuffiveconsumed">Stuff I've Consumed</a>
<ul>
<li><a href="#articles">Articles</a></li>
<li><a href="#media">Media</a></li>
</ul>
</li>
<li><a href="#resolutions">"Resolutions"</a></li>
</ul>
</li>
<li><a href="#sept2017">September 2017</a>
<ul>
<li><a href="#goalsforoctober">Goals for October</a></li>
<li><a href="#thingsivemade">Things I've Made</a>
<ul>
<li><a href="#writing">Writing</a></li>
<li><a href="#videos">Videos</a></li>
<li><a href="#images">Images</a></li>
</ul>
</li>
<li><a href="#thingsiveconsumed">Things I've Consumed</a>
<ul>
<li><a href="#interestingthingsivecommittedtoankicardsthismonth">Interesting things I've committed to anki cards this month</a></li>
<li><a href="#books">Books</a></li>
<li><a href="#videogames">Video Games</a></li>
<li><a href="#articles">Articles</a></li>
<li><a href="#papers">Papers</a></li>
<li><a href="#videos-1">Videos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#August2017">August 2017</a>
<ul>
<li><a href="#goals-for-september">Goals for September</a></li>
<li><a href="#things-ive-made">Things I've made</a>
<ul>
<li><a href="#writing">Writing:</a></li>
<li><a href="#videos">Videos:</a></li>
</ul>
</li>
<li><a href="#links">Links</a>
<ul>
<li><a href="#blogposts-web">Blogposts, Web</a></li>
<li><a href="#papers">Papers</a></li>
<li><a href="#books-audiobooks">Books / Audiobooks</a></li>
<li><a href="#manga">Manga</a></li>
<li><a href="#anime">Anime</a></li>
<li><a href="#videos-1">Videos</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-1">
<h1 id="sec-1">Monthly Links</h1>
<div class="outline-text-1" id="text-1">
<p>
This page is mostly a log in which I keep links to things I've read,
made, done, etc. It's separated by month, along with my goals for the
next month, and should be end up being in reverse chronological order
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-2">
<h2 id="sec-1-1">2019</h2>
<div class="outline-text-2" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-3">
<h3 id="sec-1-1-1">January 2019</h3>
<div class="outline-text-3" id="text-1-1-1">
</div><div id="outline-container-sec-1-1-1-1" class="outline-4">
<h4 id="sec-1-1-1-1">Goals for February</h4>
<div class="outline-text-4" id="text-1-1-1-1">
<ul class="org-ul">
<li><b>Decide which project to tackle next, begin working</b> I'm bouncing around a couple of fun ideas so I need to pick one; I'll probably end up picking the one that ends up the more technically challenging, for obvious reasons.
</li>
<li><b>Spend some time on organization</b> I've let my organization escape me a little bit so it'll be good to spend a little time to get everything back in place.
</li>
<li><b>Nail down some IRL goals this month</b>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-1-2" class="outline-4">
<h4 id="sec-1-1-1-2">Things I've Made</h4>
<div class="outline-text-4" id="text-1-1-1-2">
<ul class="org-ul">
<li><a href="http://planetbanatt.net/articles/personainsmash.html">Predicting Personality with Playstyle in Super Smash Brothers</a> People have been kicking around this question for ages so I did some research to get to the bottom of it. I opened the survey on January 8th, closed the survey on January 10th and began writing, and then posted this essay on January 18th, which means I turned around this project in roughly one week which I'm very proud of. 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-1-3" class="outline-4">
<h4 id="sec-1-1-1-3">Things I've Consumed</h4>
<div class="outline-text-4" id="text-1-1-1-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=GyUcwsjyd8Q">OCARINA OF TIME - A Masterclass in Subtext</a> A documentary about subtext in OoT; one of the most well-edited and moving pieces of content I've seen in so, so long. Sort of like my <a href="http://planetbanatt.net/articles/pingpongzen.html">Ping Pong essay</a> but so well crafted that I got self conscious thinking about my own content.
</li>
<li><a href="https://www.youtube.com/watch?v=HEfHFsfGXjs">The most unexpected answer to a counting puzzle</a> 3Blue1Brown really hits it out of the park with this video, one of the weirdest math problems I've ever seen in my entire life. <a href="https://www.youtube.com/watch?v=jsYwFizhncE">Answer</a>. <a href="https://www.youtube.com/watch?v=brU5yLm9DZM">Answer 2</a>.
</li>
<li><a href="https://www.youtube.com/watch?v=XbNWFQ4jqpQ">Bob$ on Crush vs lloD</a> one of the best SSBM analysis videos I've seen in some time.
</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-2">
<h2 id="sec-1-2">2018</h2>
<div class="outline-text-2" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-3">
<h3 id="sec-1-2-1">December 2018</h3>
<div class="outline-text-3" id="text-1-2-1">
</div><div id="outline-container-sec-1-2-1-1" class="outline-4">
<h4 id="sec-1-2-1-1">Goals for December</h4>
<div class="outline-text-4" id="text-1-2-1-1">
<ul class="org-ul">
<li><b>Resume Reading</b> as I completely and abruptly stopped reading in favor of working on the Homestuck project
</li>
<li><b>Enroll in an online class</b> since my younger brother got this for me for christmas, have to decide what I want to take, though
</li>
<li><b>Practice a bit for Genesis 6</b>
</li>
</ul>
</div>
</div>
