org/links.org
**** Things I've Made
     - [[http://planetbanatt.net/articles/visualdistance.html][Locating Visual Jokes in Homestuck with Rudimentary Computer Vision]] probably the fastest I've ever completed a project of this rigor, which was really exciting! The project took me about a month and a half and I was really committed to completing it before the year ended, which I thankfully was able to accomplish. Definitely among the more technically interesting projects I've done, performed [[https://www.reddit.com/r/homestuck/comments/aas7fb/locating_visual_jokes_in_homestuck_with/][moderately well]] on the /r/homestuck subreddit. 

**** Things I've Consumed
      - [[https://www.youtube.com/watch?v%3D0dX-Pc4nPMQ][Big Fish & Begonia]] one of the most moving films I've seen in a long time. As far as I know this is the first film from this studio and I think that if they continue making films of this quality they could establish themselves as a worthy rival to Studio Ghibli in time. Started out as a [[https://vimeo.com/67224050][flash animation]] in 2004 which is actually just wild to me.
      - [[https://escholarship.org/uc/item/9050x4r4][Reproducible Research: the Bottom Line]] paper about Claerbout's Principle, which roughly states "a paper about a computational result is advertising, the actual scholarship is in the coding environment"
      - [[https://www.youtube.com/watch?v%3DhpIs__45t5I][Justin Verlander's Impossible Inning: A Study in Velocity and Spin Rate | Baseball Bits]] randomly stumbled into this and I love the way it's put together. The music was great, also!
      - [[https://www.youtube.com/watch?v%3Dv1Mjc4zNfY4][The Conservation of The Assassination of Archimedes Narrated Version]] I love watching people skilled at their craft do their thing
      - [[https://www.youtube.com/watch?v%3DGknVZeFJ2Ug][Getting Better Faster - Painting with 80/20 Rule]] A really fun video about using quick sketch painting to study your failures in novel contexts as many times as possible within a short window.
      - [[https://www.youtube.com/watch?v%3DMijmeoH9LT4][Characters, Symbols, and the Unicode Miracle]] a cool and clear explanation of an otherwise mundane topic

**** Reflections

The links page has become, weirdly enough, one of my favorite projects. I'm reminded of a suggestion I heard a long time ago (I think it was from Day[9] but I am unsure) to keep a journal full of awesome things you have done so you can look back at it whenever you feel down about yourself. It's really cool being able to flip through and at a glance see where all your time in a year went, which months were strong and which were weak, etc. 

A useful thing I can do here is briefly reflect on 2018 and how it squared with what my goals were for the year:

I read 11/30 books, 9 reviewed on [[https://www.goodreads.com/user/show/25277520-eryk-banatt][my goodreads page]], one being a re-read (Once a Runner), and one being Anokh's /The Book of Melee/ which I obviously won't review extensively due to it being currently unreleased.

I wrote 7 longform posts on this website (Homestuck CV, STARS ALIGNED annotations, Celeste Review, Anki notes, Projects page, Boredom Types rant, Making Sense of Melee), I made 6 videos (Shinelock Punishes, Box Practical Tech, Bombs over Battlefield, Shine 2018 Clips, STARS ALIGNED, Stray Saturday), I made semi-regular appearances on the /Melee Stats Podcast/, and I revamped this website to be a lot more efficient (i.e. easier to read, mobile friendly, auto-generated from org mode documents, better in general overall). My original goal was just "15 longform posts" which I set rather aggressively to encourage shorter writings (i.e. ones that don't require months of work like Making Sense of Melee, the Homestuck CV project, STARS ALIGNED and it's annotations etc) so I it'll be okay if I cheat a little bit and consider this goal met just via converting quantity of work from one format to another.

I'm unsure if I'd consider myself the fittest I've ever been but I've made some substantial progress on that front and I'm pretty satisfied with that. I think I need to learn how to balance the different types of training into somethat that works for me because it's hard to me to juggle everything (e.g. I stop running if I go to the gym more, I stop going to the gym if I focus on rock climbing, etc). 

I think overall I'm pleased with how I was able to focus on goals I defined myself throughout 2018. I had a lot to show for my use of free time in 2018, and probably are most proud of [[http://planetbanatt.net/articles/ambistats.html][these]] [[https://www.youtube.com/watch?v%3DOGpB5d5nuPg][three]] [[http://planetbanatt.net/articles/visualdistance.html][projects]]. I think I could've done more - in particular there are two projects I started that fell through mostly due to my decision to focus on Melee a bit more during the summer (between EVO / Shine / Big House / etc). Likewise I didn't do anywhere near enough reading, at least as far as books go. I was mostly good about staying on task but there were a few months where I felt like I accomplished almost nothing. These were generally in the summer, and in general I found it difficult to get back into the swing of independent work after doing any sort of travelling. 

Anyways, 2019 goals:
- Dramatically restructure life to spend higher percentage of time doing things I find interesting instead of just a few hours a day
- Complete 15 projects, four of them being "large projects", at least five of them including a longform writing component
- Read 20 books
- Become strong


*** November 2018
**** Brief Updates
     - *Started some cool things but haven't completed them*
     - *Have been doing a lot of reading but haven't finished any books*
**** Goals for December
     - *Complete both books currently reading*
     - *Complete short-medium difficulty project and writeup* Pretty happy to be able to jog my memory of something I learned in school years ago.
     - *Reassess goals from end of year 2017* I was way off, but not so way off that I feel discouraged about it.
     - *Come up with new goals*
**** Things I've Made
     - [[https://www.youtube.com/watch?v%3DHOSbE9PMDK0][Stray Saturday]] very short highlight reel of some cool melee clips from one saturday's worth of games with my friends.
**** Things I've Consumed
