org/links.org
***** Papers
- [[https://docs.google.com/document/d/1f4P-L8RHc5hhjYk4wP4lVNCeRpXJx7h5CxWdbIjcXZ4/mobilebasic][Climbing the Ladder: An analysis of Class Divides in Player Communities]] Cool paper by Demise of the DCSS community about Social Capital in gaming communities (I think WIP?), basic idea is that players become better at games and this accrues them social capital in their scenes, which makes them more authoritative in discussions. 

"I wish to clarify that an inherent danger of climbing the social ladder in small communities is that a player can lose sight of the intense sway that they hold. Even falsities can be accepted by the weaker party when enough people gather around the stronger individual. Those with high capital should seek to view discourse in light of their own authority, and consider whether or not their opinion is actually correct or if their authority has preceded them."
- [[https://arxiv.org/abs/1811.07153][Robust Website Fingerprinting Through the Cache Occupancy Channel]] This is horrifying! tl;dr you can look into the cache of the user on your site to look at what they have open on their other tabs, which is highly effective on both normal web browsers /and Tor/. If you're gonna do something illegal make sure you close that fbi.com tab first.
***** Videos
- [[https://www.youtube.com/watch?v=5CzURm7OpAA][DEF CON 23 - Robinson and Mitchell - Knocking my neighbors kids cruddy drone offline]] amazingly witty talk about security vulnerabilities of two types of drones, comedic timing of the presentation is super on point
- [[https://www.youtube.com/watch?v=ZWQ0591PAxM][How we fit an NES game into 40 Kilobytes]] absolutely fascinating video about space optimizations in development of a small NES game
- [[https://www.youtube.com/watch?v%3DJpaq0QkepgA][ey! Look for patterns]] finding shorthand patterns to identify things without going through huge hassles to confirm things saves lots of times
- [[https://nyaa.si/view/1097157][Pop Team Epic - 01 - entirely encoded inside subtitle file]] What the F*$k?, subtitle files can draw vector graphics so somebody encoded an episode of this show entirely via subtitle file, over top of a blank black screen video file
- [[https://www.youtube.com/watch?v=2XGYr9_BiEU][BREADSWORD - Satoshi Kon and why Love is All You need episode 1 - Perfect Blue]] "Tadokoro covets the image of Mima. Rumi covets Mima's image."
- [[https://www.youtube.com/watch?v%3D5oNB6tlSZ2A][Fighting in the Age of Loneliness]] Jon Bois x Felix Biederman five-part collab documentary about Mixed Martial Arts. Surprisingly moving, wonderfully directed. 


*** October 2018
**** Brief Updates
     - *Attended The Big House 8* got 97th place which is pretty solid for me; I can be so much better than I currently am and I have lots of footage to review. In general this low-pressure headspace I was in was very good and is worth experimenting with more. [[https://www.youtube.com/playlist?list%3DPLczW29iRM_QdoOL7Oy4bm0b6-BCkmSlCz][bracket matches]]
     - *Updated the iframe CSS on this website* Youtube videos / gfycats no longer look completely stupid, nor are they insanely vertically stretched on mobile.
     - *Began taking Creatine* been thinking about taking this since I’ve heard mixed things about its effect on cognition (mostly during sleep deprivation) but now that I’m lifting weights 3x/week I figured it was worth taking regularly. Hard to separate out what is from creatine and what is from just getting stronger, but the water retention effect was much stronger than I anticipated.
**** Goals for November
     - *Practice Coding*
     - *Make Things*
**** Things I've made
     - [[http://planetbanatt.net/articles/humantheorytas.html][STARS ALIGNED - A Human Theory TAS Combo Video]] Project I've been working on for a few months (maybe since June? I've had the idea for a very long time but I think June is when I started outlining the idea). Reception to this has been really positive and I'm very happy with all the kind words people have been sending my way :) Some related links are the [[https://www.youtube.com/watch?v%3DOGpB5d5nuPg][video]], the [[http://planetbanatt.net/articles/humantheorytas.html][annotated writeup]], the [[https://twitter.com/Ambisinister_/status/1051596459378917377][twitter thread]], and the [[https://www.reddit.com/r/SSBM/comments/9o6wv0/stars_aligned_a_human_theory_tas_combo_video/][Reddit Thread]] (Reached #1 on /r/ssbm)
     - [[http://planetbanatt.net/articles/celeste.html][Just Breathe. Celeste is Game of the Decade]] long-form review of Celeste which touches upon most of my thoughts about the game. It's incredible and you should play it.
**** Things I've consumed
***** Games
      - [[https://www.deltarune.com/][deltarune - Chapter 1]] Very cute, and I think a surprisingly worthy followup to UNDERTALE so far. May or may not be part of a big writeup I'm planning, but my impressions after chapter 1 are: absolutely fire [[https://www.youtube.com/watch?v%3DeeXFCM1e-zM][OST]], overall somewhat less lovable characters but some [[https://twitter.com/Ambisinister_/status/1058158724290879493][gems]], the Suzy/Lance dynamic was hilarious and cute, the linear storytelling is a big departure and makes me think we're in for a ride (and probably a dark one), it's free??, the ending caught me entirely off guard, can't wait for chapter 2.
