org/links.org
***** Video
      - [[https://www.youtube.com/watch?v%3DXwCK1z3wT8g][Mike Dawes - Somebody That I Used To Know]] I love this sort of multi-layered solo performances, reminds me of [[https://www.youtube.com/watch?v%3D_DfQC5qHhbo][John Mayer's Live Solo of Neon]] which might be my favorite solo performance ever
      - [[https://www.youtube.com/watch?v%3Dc2zIto55QlQ][JENKEM - Matt Tomasello AKA "Rodney Mullen on Bath Salts"]] Shoestring engineering meets Skateboarding Part. One of the most creative videos I've seen in a long time!
      - [[https://www.youtube.com/watch?v%3DKFNxJVTJleE][How Gamers Killed Ultima Online's Virtual Ecology]] Richard Garriott explains how his team programmed a whole system of ecology in Ultima Online so that the AI Creatures would interact with each other, and how the playerbase just killed every killable creature possible, completely destroying this feature altogether. Humans love destruction!
      - [[https://www.youtube.com/watch?v%3DirNoHfnLXRM][Pain Elemental Reveals the Last Official Secret of Doom 2]] An RTA Viable strategy to obtain a Secret in Doom 2 previously thought to be unattainable without cheats was discovered, completely invalidating every 100% Speedrun of the game over 2 decades after the game came out.
      - [[https://www.youtube.com/watch?v%3DD3AXIGmBfa8][Sparkee - Something About Us]] Funky cover of this song
      - [[https://www.youtube.com/watch?v%3DGTcM7ydgAwo][Cigarettes, Slots, and Other Things that Aren't Addictive]] Good video essay on the problem of corporate-funded research
      - [[https://www.youtube.com/watch?v%3Dr_rSQ5lDltQ][Boiling a Live Lobster in Hennessy by Chef Henny]] It's been a long time since I've seen a video that subverted my expectations so many times in a row.
      - [[https://www.youtube.com/watch?v%3DLNidsMesxSE][Animation Bootcamp: An Indie Approach to Procedural Animation]] David Rosen of Wolfire Game talks about his procedural animation techniques for Overgrowth. I'm really impressed by how much of this task can be abstracted away to programming.
***** Books
      - [[https://bignokh.com/][The Book of Melee]] I was an alpha reader for Anokh Palakurthi's Melee upcoming 2019 nonfiction book chronicling the history of SSBM. Think it's likely to be an enjoyable read for people who follow the scene, since there's a number of really interesting little anecdotes you probably didn't know about the game. 


*** September 2018
**** Goals for October
     - *Go to The Big House 8* just have a good time, stop worrying so much about how you perform when you can't even go to locals.
     - *Lift weights again* need to get back on a beginner program and get back to where I was before. I'm not exactly untrained (I do still climb) but I'm not where I used to be and I realized I got complacent with my health goals after I lost the weight I gained second half of school.
     - *Read books* I'd like to finish Psychology Applied to Modern Life at minimum, preferably more.
     - *Finish 2-3 of my mostly finished projects* this includes my Celeste longform review, the secret video project, and the stamina bracket research, among other stray ones.
**** Things I've Made
     - [[https://twitter.com/Ambisinister_/status/1041095080881389568][Powershot shenanigans]] little TAS clip about charge shot bouncing off of shield and getting powershielded from a weird angle, seemed pretty popular!
**** Things I've Consumed
     - [[https://www.youtube.com/watch?v%3DLfX2kS7WkA0][Kirby Air Ride City Trial TAS - Achivements]] This is the mode I and everyone I know played most when this game came out so I'm glad somebody made a good TAS of it instead of focusing on the courses instead.
     - [[https://www.youtube.com/watch?v%3Ds6rQ1UHKFV8][Bottle cap pitching]] This is so cool and it looks really fun actually! I sort of want to learn to do it but I'd need two other people to be convinced to practice it which seems unlikely.
     - [[https://www.youtube.com/watch?v%3DYNrL8CQbECw][Poker Players Replay Their Most Memorable Hands | The New Yorker]] I love listening to Poker players talk about Poker because there's just so much *thought* involved. My favorite by far was Jamie Kerstetter's hand which just filled me with uncontrollable anxiety listening to it.
     - *Celeste* the best game I've played in a long time; a full review is coming soon.


*** August 2018
**** Brief Updates
     - *Went to Evo 2018* I played pretty terrible at the tournament, which was very disappointing, but seeing my friends for the first time in almost a year was so exciting and I left with a decent idea of what I want to work on. [[https://twitter.com/Ambisinister_/status/1026513823052705792][Reflection tweets]]
     - *Went to Shine 2018* Didn't do too hot in bracket but had some decent [[https://www.youtube.com/watch?v%3DPGGGjR7rk_g&list%3DPLczW29iRM_QcE7pINKBdnApPAJFUfszqB][Money Matches]] despite not being particularly winning. 
     - *Bouldering* I climbed a bunch of V3s at Origin Climbing Gym in Las Vegas during Evo, but I'm pretty confident that the grades at that gym were pretty soft. Climbed a number of V3s at assorted gyms but no overhangs.
**** Goals for September
     - *Reorient*
**** Things I've Made
***** Videos
      - [[https://www.youtube.com/watch?v%3DBQ5tkDACqoU][Shine 2018 Clips]] not technically put out this month but recorded this month, just some funny stray clips from recorded sets at this tournament.
**** Things I've Consumed
