links.html
<div id="outline-container-sec-1-2-3-4-2" class="outline-5">
<h5 id="sec-1-2-3-4-2">Video</h5>
<div class="outline-text-5" id="text-1-2-3-4-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=XwCK1z3wT8g">Mike Dawes - Somebody That I Used To Know</a> I love this sort of multi-layered solo performances, reminds me of <a href="https://www.youtube.com/watch?v=_DfQC5qHhbo">John Mayer's Live Solo of Neon</a> which might be my favorite solo performance ever
</li>
<li><a href="https://www.youtube.com/watch?v=c2zIto55QlQ">JENKEM - Matt Tomasello AKA "Rodney Mullen on Bath Salts"</a> Shoestring engineering meets Skateboarding Part. One of the most creative videos I've seen in a long time!
</li>
<li><a href="https://www.youtube.com/watch?v=KFNxJVTJleE">How Gamers Killed Ultima Online's Virtual Ecology</a> Richard Garriott explains how his team programmed a whole system of ecology in Ultima Online so that the AI Creatures would interact with each other, and how the playerbase just killed every killable creature possible, completely destroying this feature altogether. Humans love destruction!
</li>
<li><a href="https://www.youtube.com/watch?v=irNoHfnLXRM">Pain Elemental Reveals the Last Official Secret of Doom 2</a> An RTA Viable strategy to obtain a Secret in Doom 2 previously thought to be unattainable without cheats was discovered, completely invalidating every 100% Speedrun of the game over 2 decades after the game came out.
</li>
<li><a href="https://www.youtube.com/watch?v=D3AXIGmBfa8">Sparkee - Something About Us</a> Funky cover of this song
</li>
<li><a href="https://www.youtube.com/watch?v=GTcM7ydgAwo">Cigarettes, Slots, and Other Things that Aren't Addictive</a> Good video essay on the problem of corporate-funded research
</li>
<li><a href="https://www.youtube.com/watch?v=r_rSQ5lDltQ">Boiling a Live Lobster in Hennessy by Chef Henny</a> It's been a long time since I've seen a video that subverted my expectations so many times in a row.
</li>
<li><a href="https://www.youtube.com/watch?v=LNidsMesxSE">Animation Bootcamp: An Indie Approach to Procedural Animation</a> David Rosen of Wolfire Game talks about his procedural animation techniques for Overgrowth. I'm really impressed by how much of this task can be abstracted away to programming.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-3-4-3" class="outline-5">
<h5 id="sec-1-2-3-4-3">Books</h5>
<div class="outline-text-5" id="text-1-2-3-4-3">
<ul class="org-ul">
<li><a href="https://bignokh.com/">The Book of Melee</a> I was an alpha reader for Anokh Palakurthi's Melee upcoming 2019 nonfiction book chronicling the history of SSBM. Think it's likely to be an enjoyable read for people who follow the scene, since there's a number of really interesting little anecdotes you probably didn't know about the game. 
</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-4" class="outline-3">
<h3 id="sec-1-2-4">September 2018</h3>
<div class="outline-text-3" id="text-1-2-4">
</div><div id="outline-container-sec-1-2-4-1" class="outline-4">
<h4 id="sec-1-2-4-1">Goals for October</h4>
<div class="outline-text-4" id="text-1-2-4-1">
<ul class="org-ul">
<li><b>Go to The Big House 8</b> just have a good time, stop worrying so much about how you perform when you can't even go to locals.
</li>
<li><b>Lift weights again</b> need to get back on a beginner program and get back to where I was before. I'm not exactly untrained (I do still climb) but I'm not where I used to be and I realized I got complacent with my health goals after I lost the weight I gained second half of school.
</li>
<li><b>Read books</b> I'd like to finish Psychology Applied to Modern Life at minimum, preferably more.
</li>
<li><b>Finish 2-3 of my mostly finished projects</b> this includes my Celeste longform review, the secret video project, and the stamina bracket research, among other stray ones.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-4-2" class="outline-4">
<h4 id="sec-1-2-4-2">Things I've Made</h4>
<div class="outline-text-4" id="text-1-2-4-2">
<ul class="org-ul">
<li><a href="https://twitter.com/Ambisinister_/status/1041095080881389568">Powershot shenanigans</a> little TAS clip about charge shot bouncing off of shield and getting powershielded from a weird angle, seemed pretty popular!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-4-3" class="outline-4">
<h4 id="sec-1-2-4-3">Things I've Consumed</h4>
<div class="outline-text-4" id="text-1-2-4-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=LfX2kS7WkA0">Kirby Air Ride City Trial TAS - Achivements</a> This is the mode I and everyone I know played most when this game came out so I'm glad somebody made a good TAS of it instead of focusing on the courses instead.
</li>
<li><a href="https://www.youtube.com/watch?v=s6rQ1UHKFV8">Bottle cap pitching</a> This is so cool and it looks really fun actually! I sort of want to learn to do it but I'd need two other people to be convinced to practice it which seems unlikely.
</li>
<li><a href="https://www.youtube.com/watch?v=YNrL8CQbECw">Poker Players Replay Their Most Memorable Hands | The New Yorker</a> I love listening to Poker players talk about Poker because there's just so much <b>thought</b> involved. My favorite by far was Jamie Kerstetter's hand which just filled me with uncontrollable anxiety listening to it.
</li>
<li><b>Celeste</b> the best game I've played in a long time; a full review is coming soon.
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-5" class="outline-3">
<h3 id="sec-1-2-5">August 2018</h3>
<div class="outline-text-3" id="text-1-2-5">
</div><div id="outline-container-sec-1-2-5-1" class="outline-4">
<h4 id="sec-1-2-5-1">Brief Updates</h4>
<div class="outline-text-4" id="text-1-2-5-1">
<ul class="org-ul">
<li><b>Went to Evo 2018</b> I played pretty terrible at the tournament, which was very disappointing, but seeing my friends for the first time in almost a year was so exciting and I left with a decent idea of what I want to work on. <a href="https://twitter.com/Ambisinister_/status/1026513823052705792">Reflection tweets</a>
</li>
<li><b>Went to Shine 2018</b> Didn't do too hot in bracket but had some decent <a href="https://www.youtube.com/watch?v=PGGGjR7rk_g&list=PLczW29iRM_QcE7pINKBdnApPAJFUfszqB">Money Matches</a> despite not being particularly winning. 
</li>
<li><b>Bouldering</b> I climbed a bunch of V3s at Origin Climbing Gym in Las Vegas during Evo, but I'm pretty confident that the grades at that gym were pretty soft. Climbed a number of V3s at assorted gyms but no overhangs.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-5-2" class="outline-4">
<h4 id="sec-1-2-5-2">Goals for September</h4>
<div class="outline-text-4" id="text-1-2-5-2">
<ul class="org-ul">
<li><b>Reorient</b>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-5-3" class="outline-4">
<h4 id="sec-1-2-5-3">Things I've Made</h4>
<div class="outline-text-4" id="text-1-2-5-3">
</div><div id="outline-container-sec-1-2-5-3-1" class="outline-5">
<h5 id="sec-1-2-5-3-1">Videos</h5>
<div class="outline-text-5" id="text-1-2-5-3-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=BQ5tkDACqoU">Shine 2018 Clips</a> not technically put out this month but recorded this month, just some funny stray clips from recorded sets at this tournament.
</li>
</ul>
</div>
</div>
</div>
