org/links.org
***** Web
      - [[https://blog.openai.com/openai-five-benchmark/][OpenAI Dota 2 Benchmark Results]] I was skeptical that openAI would be able to defeat strong human opponents but they proved me wrong; they mostly lost to professional teams but were able to soundly win against really strong human opponents which is super exciting!
      - [[https://www.youtube.com/watch?v=oJ9H0INZ2_s][Short Film - Graeme Obree, Athlete or Genius?]] former world record holder in time trial cycling famous for building handlebars out of washing machine scrap metal to contort his body into more aerodynamic positions, twice changing the regulations for which bikes are legal in competitive cycling - they get him in a wind tunnel to test it and his body positions save roughly 60 and 10 watts compared to the standard position, which shows a lot about how important aerodynamics are to the sport.
      - [[https://www.researchgate.net/profile/Christopher_Mesagno/publication/233936536_xx2011_Mesagno_et_al_2011_Choking/data/0912f50d24db974236000000/xx2011-Mesagno-et-al-2011-Choking.pdf][Self-Presentation Origins of Choking: Evidence From Separate Pressure Manipulations]] cool paper on choking under pressure, highly linked towards concerns of self-presentation
      - [[https://www.reddit.com/r/SSBM/comments/97tqva/top_1000_melee_win_percentage_leaderboards/?st%3DJKX17V6I&sh%3D5af12945][MyHandsHurt]] another person did a look at a bunch of smash.gg data and came to similarly weak conclusions about things as I did in Making Sense of Melee, most notably the rise of Hanky Panky
      - [[https://www.youtube.com/watch?v%3DPCBTZh41Ris&feature%3Dyoutu.be&t%3D2m13s][Everybody Dance Now]] and [[https://arxiv.org/pdf/1808.07371.pdf][Paper]] holy shittttt GANS ARE SO COOL
      - [[https://www.youtube.com/watch?v%3DA8zWWp0akUU][What if English Were Phonetically Consistent?]] cute video
      - [[https://www.youtube.com/watch?v%3Dec7Iwlo2ets][Fox vs Ice Climbers Analysis: Fiction vs ARMY at Nimbus 29]] lots of useful information about this matchup
      - [[https://github.com/kotritrona/osumapper][osumapper - an automatic beatmap generator using Tensorflow / Deep Learning]] this was one of the ideas in my ideas document so I'm both sad that somebody beat me to it and happy that my idea was validated as an interesting one.


*** July 2018
**** Brief Updates
- *Sent a V3 Problem* Didn't get a video recording of it, but I sent an interesting slab problem at The Gravity Vault in Randor, PA. In my send I got stuck on the last move for maybe three full minutes before getting past it with a weird coordination mantle + pistol squat move, which I felt really good about even though it suggests my move into the last move was probably not super optimal.
- *Sent another, different V3 Problem* Video [[https://www.youtube.com/watch?v%3Dzvj-iehyW9g][here]], another relatively easy problem which I abused my height to make easier. I want to send this cleaner (as I did with that [[https://www.youtube.com/watch?v%3D4rmQWE4jCbY][super weird teal V2]] that everyone at my gym hates, myself included). I really liked the mini cut-loose move near the end but I think this climb would be easier with better footwork especially after the third hand move (flag is unnecessary). I think a footswap after the fifth hand move -> move right foot to hold right next to it skips the need for cutting loose, but I could be misunderstanding how good the holds are from that position from this video. Overall I think definitely a relatively easy v3 which I think is appropriate for what I consider my current level at climbing (V2+/V3-)
- *Practiced a bunch for Evo 2018* I'm very excited for this event and I think I'm in pretty good form for it - I'm unsure if I'll do well or not but I'm looking forward to playing a lot of great melee with strong players and having a good time in Las Vegas.

**** Goals for August
- *Play Well at Evo 2018, get hours in against new, strong players*
- *Send two more V3s, one of which must be a roof/overhang* 
- *Cut weight back down to 150-153 range*
- *Resume work on programming work*
- *Begin work on secret SSBM video project*

**** Things I've Made
- [[http://www.planetbanatt.net/articles/anki.html][Notes on Spaced Repetition]] Some running notes for my anki card usage, which I will probably update as I get new useful thoughts on using it
- [[http://www.planetbanatt.net/articles/omron.html][How Variable are Omron Scales?]] I got back up to 160 so I ran some measurements on my bodyfat / muscle percentages and they were much better than the last time I was this weight, which is very exciting and motivating
- [[https://twitter.com/ThePGstats/status/1014931922299088898][MPGR Summer Top 50 Ballot]] After a bunch of discussion, PGR ended up sticking with the ballot system instead of using the algorithmic ranking. I was a panelist this season, and spent a good amount of time making this ballot (which will remain hidden to avoid external pressure influencing my vote). 
- [[https://www.twitch.tv/videos/289261916][MPGR Roundtable Part 2: #40-31]] I appear as a guest on Panda Global's Twitch show discussing the summerrank top 50, along with Aiden, Appel, Gimmedatwheat, Edwinbudding, and PracticalTAS.

**** Things I've Consumed
***** Web
- [[https://www.broadinstitute.org/what-broad/areas-focus/project-spotlight/questions-and-answers-about-crispr][What is CRISPR?]] Research on gene editing, a bit out of my element but very interesting
- [[http://bactra.org/notebooks/][Notebooks - Bactra.org]] A fine addition to my "Visions for this website in 30 years" list, along with [[http://www.gwern.net/][gwern.net]]. This is a page of notebooks written by [[https://en.wikipedia.org/wiki/Cosma_Shalizi][Cosma Shalizi]], a professor of Statistics at CMU. There's so much info here! From this alone I'll have a list of books to read that will never end.

