org/links.org
***** Video
- [[https://www.youtube.com/watch?v%3DQkXeMoBPSDk][Who Is America? (2018) | Official Clip Ep 2]] I actually just can't believe this video
- [[https://www.youtube.com/watch?v=mcNe1I8X2fg][Secrets to easiest and most athletic BULKING DIET - Eric Bugenhagen]] This dude passionately yelling about food for 15 minutes is worth watching even if you never plan on bulking ever. "If you can't bulk with that direction I've just given you...... you gotta get off my channel, you just don't have the mindset"
- [[https://www.youtube.com/watch?v=absNLWpjnqc][A Bug's Life is LITERALLY Seven Samurai - BREADSWORD]] Breadsword makes consistent incredible content - he's sort of like "SoulBroNo3 meets Nerdwriter, if Nerdwriter made content with substance". I thought his [[https://www.youtube.com/watch?v%3Db9sycdSkngA][Treasure Planet]] video was great, and this is his most recent work which I found to be impressively novel and interesting. Definitely worth a watch. 
- [[https://www.youtube.com/watch?v=nwQmwT1ULMU&feature=youtu.be][The Mystery of the Mole Playing Rough]] cute video explaining the possible reasons for a bizarre enemy placement at a specific spot in Earthbound, exploring a flag in memory set in specific situations - author infers that it is a deliberate decision, which is a hilarious hack if it's true.

***** Books
- [[https://www.goodreads.com/review/show/2300849954?book_show_action=false][Proofs and Refutations: The Logic of Mathematical Discovery]] The Republic meets Philosophy of History of Mathematics. Full thoughts in the link.
- [[https://www.goodreads.com/review/show/2476532471][The Rock Warrior's Way: Mental Training for Climbers]] Decent book about mental game in rock climbing, weirdly zen influenced book but honestly not that bad, review in link.


*** June 2018 
**** Goals for July
- *Send another V3 Problem* I have one that I'm working on but I am worried they will take it down before I get the last move, so if I can't get it by the end of the month then I'll need to find something else
- *Practice an unreasonable amount for Evo 2018* It's probably because I can no longer take Melee for granted and play it every day, but I haven't felt this motivated for a tournament in a very long time. I really want to perform well so I've been practicing a lot and I don't want to let this motivation fizzle out before the event.
- *Work on projects when you have time* I have a lot of things in the works, among which the things I have not finished from months ago, but my priorities have temporarily shifted for now so I think if I finish any real projects in the next month I'll view it as a bonus rather than an explicit goal.
**** Things I have Made
- [[http://planetbanatt.net][Overhauled personal website]] I now generate this entire website from emacs org files; going back and transforming all my html documents to org files was sort of a pain but luckily with pandoc it didn't take longer than an afternoon - the rough part was wrangling with the org html export, which I eventually managed to nail down. It looks cool now! Still some work to be done but not bad.
- [[https://www.youtube.com/watch?v=hsdz2mTnhfM][V3 Boulder Problem]] interesting mantle -> mantle thing going on in this problem; it feels a little easy for a V3 but I'm not complaining since it let me meet my goal for this month! I've now completed every V2 problem in the gym so I'm currently focusing on climbing them cleanly / V3 problems / waiting for new problems
- [[https://www.youtube.com/watch?v%3DYAW1Edfy290][V2 Slab Problem]] really cool problem at a gym I don't usually go to
- [[https://twitter.com/Ambisinister_/status/1013181502375563264][Fountain of Dreams is Cool Now]] stupid movement idea I came up with on this stage

**** Things I have Consumed
- [[https://rockclimberstrainingmanual.com/tools-for-rock-climbing-training/the-making-of-a-rock-prodigy/][Tools for Rock Climbing Training: The Making of a 'Rockprodigy']] a lot of really great quotes in here, I'm starting to get really motivated for improvement in climbing and melee so I've been spending a lot less time on projects and a lot more time on practice.
- [[https://www.youtube.com/watch?v%3DVkFSVBL4AI8][Ocarina of Time glitch exhibition]] 2 hour presentation by ZFG of OoT glitches that are not useful in speedruns. I enjoyed it a lot!
- [[https://www.youtube.com/watch?v%3DoySLq4y-c8M][Sub Float - Quetzalcoatl]] Melee's preimere Peach Frame Data person documents a setup for floating lower than ground float height, allowing for +4 nairs. Not super useful since setup burns your doublejump making it quite dangerous, but almost baffling that the game went this long without anyone discovering this until now.
- [[https://www.youtube.com/watch?v%3DY99Wj-NStok][Choco Mountain: The History of Mario Kart 64's Most Infamous Track]] w e a t h e r t e n k o


*** May 2018
**** Goals for June
- Send a v3 boulder problem
- Make big changes to website formatting using emacs HTML export
- Complete posts I keep postponing work on
- Make it very straightforward to export new things to this site now that everything is centralized in emacs (!!)
**** Things I have Made
- [[https://www.youtube.com/watch?v=2sSQUKU-UnQ][Bombs over Battlefield]] Items combo video feat R2DLiu, Vickram, lpac, and myself, super funny 
- [[https://www.youtube.com/watch?v=5gKaeUDHNzU][Melee Stats Podcast - Episode 9]] I'm in this episode

**** Things I have Consumed
- [[https://fivethirtyeight.com/features/i-faced-off-against-the-worlds-best-chess-player-you-will-totally-believe-what-happened-next/][I Faced Off Against The World’s Best Chess Player. You Will Totally Believe What Happened Next.]] Not exactly a groundbreaking experience if you are a chess player, but it was really cool to see a levelheaded outsider brush up against the chess community and say reasonable things (unlike another article which is derisively hyperlinked in this one)
- [[https://superuser.com/questions/67170/how-do-i-complete-file-paths-in-emacs][find paths in emacs]] ugh
- [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html][python inline in org mode]] sick



*** April 2018
