org/links.org
**** Goals for May
     - *Turn 23*
     - *Complete Bracket Stamina post* (this has gone on for too long as it is, since I keep encountering cool things abour it, and I made less progress than I would've liked on it despite working on it for ~20ish hours this month, but a lot of that is due to the fact that I am learning emacs through this project; I think I'm mostly completed with interesting things to encounter so I expect to be completed by mid may)
     - *Become very comfortable with emacs*; a friend of mine showed me his emacs setup and I realized that I had virtually the same workflow except strewn across 15 different programs and within two weeks of using it I am back/surpassing to my old productivity speed despite regularly pausing to remember how to perform the "copy" command. Fully expect to sink 300+ hours into configuring this program within the next year but as it stands I am already hooked on it. 
     - *Begin working on next coding project* surprise for now.
     - *Complete some stray writing projects*
**** Things I have Made

***** Videos
      - [[https://www.youtube.com/watch?v%3Dlkz70KroQsU][Box Practical Tech]] A short demo of niche tech skill possible on box controllers with modifiers
      - [[https://www.youtube.com/watch?v%3D9eRnWOFI7gE][Melee Stats Podcast - Episode 1]] I talk about how PAL is bad in this episode
      - [[https://www.youtube.com/watch?v%3DUCINugqRZmQ][Melee Stats Podcast - Episode 3]] I talk about box controllers in this episode, MSPR25 
      - [[https://www.youtube.com/watch?v%3DLS5wuGOlLl0][Melee Stats Podcast - Episode 5]] We talk about summit, I wear a tinfoil hat
**** Things I have Consumed
***** Articles
      - [[http://r2dliu.com/articles/ledgedash.html][On Ledgedashing and PODE (R2Dliu)]] PODE lets you press the perfect ledgedash angle and get a ledgedrop because it pseudo-buffers the horizontal input so you get one frame of vertical down movement first.
      - [[http://docs.python-guide.org/en/latest/writing/gotchas/][Python Gotchas - Default Values]] I started trying to use these in my projects without knowing why they worked and it caused me problems
***** References
      - [[https://www.gnu.org/software/emacs/tour/][Emacs tour]] useful introduction
      - [[https://orgmode.org/guide/][Org Mode guide]] useful document in general
***** Videos
      - [[https://www.youtube.com/watch?v%3DPTmhBRo-91s&feature%3Dyoutu.be][Twilight Princess JotWad TAS in 4:33.54{Post Commentary}]] A short 4 minute TAS with rhyming commentary and a punchline that had me rolling
      - [[https://www.youtube.com/watch?v%3DSzA2YODtgK4][Getting Started with Org Mode]] The second person I've watched use this software, which convinced me it was utter wizardry
      - [[https://www.youtube.com/watch?v%3DAmgkSdhK4K8][Who cares about topology? (Inscribed rectangle problem)]] Was introduced to 3Blue1Brown recently and man what a great channel
      - [[https://www.youtube.com/watch?v%3DspUNpyF58BY][But what is the Fourier Transform? A visual introduction.]] More 3Blue1Brown
      - [[https://www.youtube.com/watch?v%3DZsO4w7hTdWE][WAX - RED]] We doing shit that people do in only dreams  
      - [[https://www.youtube.com/watch?v=Wsf6tkST7bI][Lynn Hill at Hueco Tanks - Patagonia Ambassador goes Bouldering in Texas]] I've been really into bouldering recently and I think this video is a good show of why
      - [[https://www.99boulders.com/bouldering-footwork-fundamentals][Bouldering Footwork Fundamentals - 99boulders]] useful reference mostly for parts of climbing shoe




*** March 2018
    :PROPERTIES:
    :CUSTOM_ID: march
    :END:

**** Goals for April
    :PROPERTIES:
    :CUSTOM_ID: goalsforapril
    :END:

-  Continue learning math, learn some beginner Chinese
-  SSBM: study 30 hours of videos, implement dash out of crouch,
   continue working on aerial drift
-  Complete bracket project (which has proven to be much more
   interesting than I anticipated) and flashcards writeup
-  Learn to use vim, get comfortable with it by playing some
   [[http://crawl.develz.org/wordpress/][DCSS]] (lol)

**** Updates
    :PROPERTIES:
    :CUSTOM_ID: updates
    :END:

-  Downloaded [[http://www.wonderapps.se/atracker/][Atracker]] which I
   plan on using to make more quantifiable monthly goals. Measurement
   defeats all.
-  Did a brief cut and got back down to ~150 from 155

**** Things I've made
     :PROPERTIES:
     :CUSTOM_ID: thingsivemade
     :END:

***** Writing
     :PROPERTIES:
     :CUSTOM_ID: writing
     :END:

[[http://planetbanatt.net/projects.html][Projects]] I updated my
Projects page to summarize the independent work I've completed, since
Google analytics showed me people clicked that often after reading
Making Sense of Melee. It's only my biggest / coolest projects, and at
the moment the prose form is a little wordy but it's better than what I
had before. I'll probably Reupdate it very soon with images but this
should be a better placeholder

[[http://planetbanatt.net/resume.pdf][Resume]] I updated my resume

**** Things I've consumed
     :PROPERTIES:
     :CUSTOM_ID: thingsiveconsumed
     :END:

***** Books
     :PROPERTIES:
     :CUSTOM_ID: books
     :END:

[[http://integrateddaniel.info/book/][Mastering the Core Teachings of
the Buddha]] Weird, but okay book. Full thoughts
[[https://www.goodreads.com/review/show/2323153658?book_show_action=false][here]].

***** Articles
     :PROPERTIES:
     :CUSTOM_ID: articles
     :END:

[[https://www.google.com/amp/s/tim.blog/2012/12/11/how-to-play-the-guitar/amp/][How to Finally Play the Guitar: 80/20 Guitar and Minimalist Music]]

***** Videos
     :PROPERTIES:
     :CUSTOM_ID: videos
     :END:

[[https://www.youtube.com/watch?v=1298ltL8_SA][she - By Your Side]]
Pictures and sounds, pixels turn into lines

[[https://www.youtube.com/watch?v%3DIndm8KGXaEU][{TAS} SSBM (Melee) Fox 1P Mode All-Star {Very Hard, No Damage Clear}]] This video is a literal
masterpiece and I spent something like a full hour watching parts of it
frame by frame several times

[[https://www.youtube.com/watch?v=unGoHAX_gmk][GUNSHIP - Fly For Your
Life]] Interesting what / how much the soundtrack adds to the original
animation [[https://www.youtube.com/watch?v=AjXr9Nj5ZbI][Paths of Hate]]

[[https://www.youtube.com/watch?v=4a1TUszkMfI][The NCAA tournament is a
loser machine | Chart Party]] Singlehandedly delayed my bracket project
a few weeks - I love Jon Bois

--------------


*** February 2018
    :PROPERTIES:
    :CUSTOM_ID: february
    :END:

