links.html



<div id="outline-container-sec-1-2-9" class="outline-3">
<h3 id="sec-1-2-9">April 2018</h3>
<div class="outline-text-3" id="text-1-2-9">
</div><div id="outline-container-sec-1-2-9-1" class="outline-4">
<h4 id="sec-1-2-9-1">Goals for May</h4>
<div class="outline-text-4" id="text-1-2-9-1">
<ul class="org-ul">
<li><b>Turn 23</b>
</li>
<li><b>Complete Bracket Stamina post</b> (this has gone on for too long as it is, since I keep encountering cool things abour it, and I made less progress than I would've liked on it despite working on it for ~20ish hours this month, but a lot of that is due to the fact that I am learning emacs through this project; I think I'm mostly completed with interesting things to encounter so I expect to be completed by mid may)
</li>
<li><b>Become very comfortable with emacs</b>; a friend of mine showed me his emacs setup and I realized that I had virtually the same workflow except strewn across 15 different programs and within two weeks of using it I am back/surpassing to my old productivity speed despite regularly pausing to remember how to perform the "copy" command. Fully expect to sink 300+ hours into configuring this program within the next year but as it stands I am already hooked on it. 
</li>
<li><b>Begin working on next coding project</b> surprise for now.
</li>
<li><b>Complete some stray writing projects</b>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-9-2" class="outline-4">
<h4 id="sec-1-2-9-2">Things I have Made</h4>
<div class="outline-text-4" id="text-1-2-9-2">
</div><div id="outline-container-sec-1-2-9-2-1" class="outline-5">
<h5 id="sec-1-2-9-2-1">Videos</h5>
<div class="outline-text-5" id="text-1-2-9-2-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=lkz70KroQsU">Box Practical Tech</a> A short demo of niche tech skill possible on box controllers with modifiers
</li>
<li><a href="https://www.youtube.com/watch?v=9eRnWOFI7gE">Melee Stats Podcast - Episode 1</a> I talk about how PAL is bad in this episode
</li>
<li><a href="https://www.youtube.com/watch?v=UCINugqRZmQ">Melee Stats Podcast - Episode 3</a> I talk about box controllers in this episode, MSPR25 
</li>
<li><a href="https://www.youtube.com/watch?v=LS5wuGOlLl0">Melee Stats Podcast - Episode 5</a> We talk about summit, I wear a tinfoil hat
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-9-3" class="outline-4">
<h4 id="sec-1-2-9-3">Things I have Consumed</h4>
<div class="outline-text-4" id="text-1-2-9-3">
</div><div id="outline-container-sec-1-2-9-3-1" class="outline-5">
<h5 id="sec-1-2-9-3-1">Articles</h5>
<div class="outline-text-5" id="text-1-2-9-3-1">
<ul class="org-ul">
<li><a href="http://r2dliu.com/articles/ledgedash.html">On Ledgedashing and PODE (R2Dliu)</a> PODE lets you press the perfect ledgedash angle and get a ledgedrop because it pseudo-buffers the horizontal input so you get one frame of vertical down movement first.
</li>
<li><a href="http://docs.python-guide.org/en/latest/writing/gotchas/">Python Gotchas - Default Values</a> I started trying to use these in my projects without knowing why they worked and it caused me problems
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-9-3-2" class="outline-5">
<h5 id="sec-1-2-9-3-2">References</h5>
<div class="outline-text-5" id="text-1-2-9-3-2">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/tour/">Emacs tour</a> useful introduction
</li>
<li><a href="https://orgmode.org/guide/">Org Mode guide</a> useful document in general
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-9-3-3" class="outline-5">
<h5 id="sec-1-2-9-3-3">Videos</h5>
<div class="outline-text-5" id="text-1-2-9-3-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=PTmhBRo-91s&feature=youtu.be">Twilight Princess JotWad TAS in 4:33.54{Post Commentary}</a> A short 4 minute TAS with rhyming commentary and a punchline that had me rolling
</li>
<li><a href="https://www.youtube.com/watch?v=SzA2YODtgK4">Getting Started with Org Mode</a> The second person I've watched use this software, which convinced me it was utter wizardry
</li>
<li><a href="https://www.youtube.com/watch?v=AmgkSdhK4K8">Who cares about topology? (Inscribed rectangle problem)</a> Was introduced to 3Blue1Brown recently and man what a great channel
</li>
<li><a href="https://www.youtube.com/watch?v=spUNpyF58BY">But what is the Fourier Transform? A visual introduction.</a> More 3Blue1Brown
</li>
<li><a href="https://www.youtube.com/watch?v=ZsO4w7hTdWE">WAX - RED</a> We doing shit that people do in only dreams  
</li>
<li><a href="https://www.youtube.com/watch?v=Wsf6tkST7bI">Lynn Hill at Hueco Tanks - Patagonia Ambassador goes Bouldering in Texas</a> I've been really into bouldering recently and I think this video is a good show of why
</li>
<li><a href="https://www.99boulders.com/bouldering-footwork-fundamentals">Bouldering Footwork Fundamentals - 99boulders</a> useful reference mostly for parts of climbing shoe
</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-march" class="outline-3">
<h3 id="march"><a id="sec-1-2-10" name="sec-1-2-10"></a>March 2018</h3>
<div class="outline-text-3" id="text-march">
</div>

<div id="outline-container-goalsforapril" class="outline-4">
<h4 id="goalsforapril"><a id="sec-1-2-10-1" name="sec-1-2-10-1"></a>Goals for April</h4>
<div class="outline-text-4" id="text-goalsforapril">

<ul class="org-ul">
<li>Continue learning math, learn some beginner Chinese
</li>
<li>SSBM: study 30 hours of videos, implement dash out of crouch,
continue working on aerial drift
</li>
<li>Complete bracket project (which has proven to be much more
interesting than I anticipated) and flashcards writeup
</li>
<li>Learn to use vim, get comfortable with it by playing some
<a href="http://crawl.develz.org/wordpress/">DCSS</a> (lol)
</li>
</ul>
</div>
</div>

<div id="outline-container-updates" class="outline-4">
<h4 id="updates"><a id="sec-1-2-10-2" name="sec-1-2-10-2"></a>Updates</h4>
<div class="outline-text-4" id="text-updates">

<ul class="org-ul">
<li>Downloaded <a href="http://www.wonderapps.se/atracker/">Atracker</a> which I
plan on using to make more quantifiable monthly goals. Measurement
defeats all.
</li>
<li>Did a brief cut and got back down to ~150 from 155
</li>
</ul>
</div>
</div>

<div id="outline-container-thingsivemade" class="outline-4">
<h4 id="thingsivemade"><a id="sec-1-2-10-3" name="sec-1-2-10-3"></a>Things I've made</h4>
<div class="outline-text-4" id="text-thingsivemade">
</div>

<div id="outline-container-writing" class="outline-5">
<h5 id="writing"><a id="sec-1-2-10-3-1" name="sec-1-2-10-3-1"></a>Writing</h5>
<div class="outline-text-5" id="text-writing">

<p>
<a href="http://planetbanatt.net/projects.html">Projects</a> I updated my
Projects page to summarize the independent work I've completed, since
Google analytics showed me people clicked that often after reading
Making Sense of Melee. It's only my biggest / coolest projects, and at
the moment the prose form is a little wordy but it's better than what I
had before. I'll probably Reupdate it very soon with images but this
should be a better placeholder
</p>

<p>
<a href="http://planetbanatt.net/resume.pdf">Resume</a> I updated my resume
</p>
</div>
</div>
</div>

<div id="outline-container-thingsiveconsumed" class="outline-4">
<h4 id="thingsiveconsumed"><a id="sec-1-2-10-4" name="sec-1-2-10-4"></a>Things I've consumed</h4>
<div class="outline-text-4" id="text-thingsiveconsumed">
</div>

<div id="outline-container-books" class="outline-5">
<h5 id="books"><a id="sec-1-2-10-4-1" name="sec-1-2-10-4-1"></a>Books</h5>
<div class="outline-text-5" id="text-books">

<p>
<a href="http://integrateddaniel.info/book/">Mastering the Core Teachings of
the Buddha</a> Weird, but okay book. Full thoughts
<a href="https://www.goodreads.com/review/show/2323153658?book_show_action=false">here</a>.
</p>
</div>
</div>

<div id="outline-container-articles" class="outline-5">
<h5 id="articles"><a id="sec-1-2-10-4-2" name="sec-1-2-10-4-2"></a>Articles</h5>
<div class="outline-text-5" id="text-articles">

<p>
<a href="https://www.google.com/amp/s/tim.blog/2012/12/11/how-to-play-the-guitar/amp/">How to Finally Play the Guitar: 80/20 Guitar and Minimalist Music</a>
</p>
</div>
</div>

<div id="outline-container-videos" class="outline-5">
<h5 id="videos"><a id="sec-1-2-10-4-3" name="sec-1-2-10-4-3"></a>Videos</h5>
<div class="outline-text-5" id="text-videos">

<p>
<a href="https://www.youtube.com/watch?v=1298ltL8_SA">she - By Your Side</a>
Pictures and sounds, pixels turn into lines
</p>

<p>
<a href="https://www.youtube.com/watch?v=Indm8KGXaEU">{TAS} SSBM (Melee) Fox 1P Mode All-Star {Very Hard, No Damage Clear}</a> This video is a literal
masterpiece and I spent something like a full hour watching parts of it
frame by frame several times
</p>

<p>
<a href="https://www.youtube.com/watch?v=unGoHAX_gmk">GUNSHIP - Fly For Your
Life</a> Interesting what / how much the soundtrack adds to the original
animation <a href="https://www.youtube.com/watch?v=AjXr9Nj5ZbI">Paths of Hate</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=4a1TUszkMfI">The NCAA tournament is a
loser machine | Chart Party</a> Singlehandedly delayed my bracket project
a few weeks - I love Jon Bois
</p>

<hr  />
</div>
</div>
</div>
</div>
