org/links.org
**** Goals for March
    :PROPERTIES:
    :CUSTOM_ID: goalsformarch
    :END:

-  Finish Bracket Stamina project and Spaced repetition post; finish
   reading Proofs and Refutations; make anki cards on US History; Start
   working through Linear Algebra Done Right and
   [[http://www.math.pku.edu.cn/teachers/anjp/textbook.pdf][this]].
-  SSBM: continue working on implementing aerial drift, specifically out
   of short hop; work on making platform punishes against fastfallers
   more consistent
-  Practice some substantial amount of time this month learning to play
   guitar, figure out some way to track hours practiced (for this and
   for other things)
-  Maintain your reading habits but focus primarily on math / guitar /
   SSBM / writing

**** Updates
    :PROPERTIES:
    :CUSTOM_ID: updates
    :END:

Health

-  finished a two month trial period for
   [[https://examine.com/supplements/bacopa-monnieri/][Bacopa
   Monnieri]]. Ended up observing a rise in correct answers for new +
   young anki cards of about 8%, and no change in mature cards. I didn't
   do any blinding, and would probably have to revisit this if I wanted
   to explore it deeply in any capacity. I don't really feel like bacopa
   gave me anything super valuable given the magnitude of the effect, so
   I've discontinued taking it (although I might consider taking it
   again if I ever decide to become a student again). Funny to think
   about how effectively you can replace the use of short term memory
   with good external capturing like anki or Evernote.

SSBM

-  spent virtually my entire month practicing backwards aerial drift.
   Entered a tournament and placed pretty well despite feeling pretty
   off tech-skill wise. Feel good about practice paying off somewhat for
   me.

Misc

-  Decided against adding an RSS feed, since adding one for a static
   website is more trouble than it's worth and I have a far too small
   readership that would ever use it.
-  Met most of my goals from last month (only finished 2 books but did a
   lot of reading), still need some calibration but enough of my time
   went towards practicing melee that I had a slightly below average
   level of productivity

**** Stuff I've made
     :PROPERTIES:
     :CUSTOM_ID: stuffivemade
     :END:

***** Articles
     :PROPERTIES:
     :CUSTOM_ID: articles
     :END:

[[http://www.planetbanatt.net/articles/boredom.html][A Tale of Two
Boredoms]] A bit more blogposty and philosophical than my usual writing,
but I felt I needed to flesh out my ideas on this topic a bit more
properly. /"Once you saw and named the problems, you couldn't stop
seeing them, it just got more annoying every day."/

***** Videos
     :PROPERTIES:
     :CUSTOM_ID: videos
     :END:

[[https://www.youtube.com/watch?v=HlsDiITk0YM][Shinelock Punishes]]
Somebody asked me to make a video on this and I've been meaning to make
a video anyways so I threw something together.

[[https://twitter.com/Ambisinister_/status/969056550009655296][More fun
Peach TAS things]] ideas mostly courtesy of lpac / r2dliu

**** Stuff I've Consumed
     :PROPERTIES:
     :CUSTOM_ID: stuffiveconsumed
     :END:

***** Books
     :PROPERTIES:
     :CUSTOM_ID: books
     :END:

[[https://drive.google.com/file/d/1gnZQn0EJGI3c1jdxUXulcLH8bb-oQ1ls/view][Rationality:
Abridged]] Summary by Quaerendo of Eliezer Yudkowsky's "Rationality:
From AI to Zombies", which desperately needed a summary. Very cool and
lots of good ideas. Full thoughts
[[https://www.goodreads.com/review/show/2246451089?book_show_action=true][Here]]

[[https://www.goodreads.com/book/show/18937.In_the_Beginning_Was_the_Command_Line][In
the Beginning... Was the Command Line]] Very well written, slightly
elitist history of operating systems. Fun analogies. Full thoughts
[[https://www.goodreads.com/review/show/1963072847?book_show_action=false&from_review_page=1][Here]]

