links.html


<div id="outline-container-february" class="outline-3">
<h3 id="february"><a id="sec-1-2-11" name="sec-1-2-11"></a>February 2018</h3>
<div class="outline-text-3" id="text-february">
</div>

<div id="outline-container-goalsformarch" class="outline-4">
<h4 id="goalsformarch"><a id="sec-1-2-11-1" name="sec-1-2-11-1"></a>Goals for March</h4>
<div class="outline-text-4" id="text-goalsformarch">

<ul class="org-ul">
<li>Finish Bracket Stamina project and Spaced repetition post; finish
reading Proofs and Refutations; make anki cards on US History; Start
working through Linear Algebra Done Right and
<a href="http://www.math.pku.edu.cn/teachers/anjp/textbook.pdf">this</a>.
</li>
<li>SSBM: continue working on implementing aerial drift, specifically out
of short hop; work on making platform punishes against fastfallers
more consistent
</li>
<li>Practice some substantial amount of time this month learning to play
guitar, figure out some way to track hours practiced (for this and
for other things)
</li>
<li>Maintain your reading habits but focus primarily on math / guitar /
SSBM / writing
</li>
</ul>
</div>
</div>

<div id="outline-container-updates" class="outline-4">
<h4 id="updates"><a id="sec-1-2-11-2" name="sec-1-2-11-2"></a>Updates</h4>
<div class="outline-text-4" id="text-updates">

<p>
Health
</p>

<ul class="org-ul">
<li>finished a two month trial period for
<a href="https://examine.com/supplements/bacopa-monnieri/">Bacopa
Monnieri</a>. Ended up observing a rise in correct answers for new +
young anki cards of about 8%, and no change in mature cards. I didn't
do any blinding, and would probably have to revisit this if I wanted
to explore it deeply in any capacity. I don't really feel like bacopa
gave me anything super valuable given the magnitude of the effect, so
I've discontinued taking it (although I might consider taking it
again if I ever decide to become a student again). Funny to think
about how effectively you can replace the use of short term memory
with good external capturing like anki or Evernote.
</li>
</ul>

<p>
SSBM
</p>

<ul class="org-ul">
<li>spent virtually my entire month practicing backwards aerial drift.
Entered a tournament and placed pretty well despite feeling pretty
off tech-skill wise. Feel good about practice paying off somewhat for
me.
</li>
</ul>

<p>
Misc
</p>

<ul class="org-ul">
<li>Decided against adding an RSS feed, since adding one for a static
website is more trouble than it's worth and I have a far too small
readership that would ever use it.
</li>
<li>Met most of my goals from last month (only finished 2 books but did a
lot of reading), still need some calibration but enough of my time
went towards practicing melee that I had a slightly below average
level of productivity
</li>
</ul>
</div>
</div>

<div id="outline-container-stuffivemade" class="outline-4">
<h4 id="stuffivemade"><a id="sec-1-2-11-3" name="sec-1-2-11-3"></a>Stuff I've made</h4>
<div class="outline-text-4" id="text-stuffivemade">
</div>

<div id="outline-container-articles" class="outline-5">
<h5 id="articles"><a id="sec-1-2-11-3-1" name="sec-1-2-11-3-1"></a>Articles</h5>
<div class="outline-text-5" id="text-articles">

<p>
<a href="http://www.planetbanatt.net/articles/boredom.html">A Tale of Two
Boredoms</a> A bit more blogposty and philosophical than my usual writing,
but I felt I needed to flesh out my ideas on this topic a bit more
properly. /"Once you saw and named the problems, you couldn't stop
seeing them, it just got more annoying every day."/
</p>
</div>
</div>

<div id="outline-container-videos" class="outline-5">
<h5 id="videos"><a id="sec-1-2-11-3-2" name="sec-1-2-11-3-2"></a>Videos</h5>
<div class="outline-text-5" id="text-videos">

<p>
<a href="https://www.youtube.com/watch?v=HlsDiITk0YM">Shinelock Punishes</a>
Somebody asked me to make a video on this and I've been meaning to make
a video anyways so I threw something together.
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/969056550009655296">More fun
Peach TAS things</a> ideas mostly courtesy of lpac / r2dliu
</p>
</div>
</div>
</div>

<div id="outline-container-stuffiveconsumed" class="outline-4">
<h4 id="stuffiveconsumed"><a id="sec-1-2-11-4" name="sec-1-2-11-4"></a>Stuff I've Consumed</h4>
<div class="outline-text-4" id="text-stuffiveconsumed">
</div>

<div id="outline-container-books" class="outline-5">
<h5 id="books"><a id="sec-1-2-11-4-1" name="sec-1-2-11-4-1"></a>Books</h5>
<div class="outline-text-5" id="text-books">

<p>
<a href="https://drive.google.com/file/d/1gnZQn0EJGI3c1jdxUXulcLH8bb-oQ1ls/view">Rationality:
Abridged</a> Summary by Quaerendo of Eliezer Yudkowsky's "Rationality:
From AI to Zombies", which desperately needed a summary. Very cool and
lots of good ideas. Full thoughts
<a href="https://www.goodreads.com/review/show/2246451089?book_show_action=true">Here</a>
</p>

<p>
<a href="https://www.goodreads.com/book/show/18937.In_the_Beginning_Was_the_Command_Line">In
the Beginning&#x2026; Was the Command Line</a> Very well written, slightly
elitist history of operating systems. Fun analogies. Full thoughts
<a href="https://www.goodreads.com/review/show/1963072847?book_show_action=false&from_review_page=1">Here</a>
</p>
</div>
