org/links.org
****** Articles
      :PROPERTIES:
      :CUSTOM_ID: articles-1
      :END:

[[http://oracleselixir.com/2015/10/egr-and-mlr-new-team-ratings/][EGR
AND MLR: NEW TEAM RATINGS]] Shown to me by Shi Deng of Big Blue esports.
A pretty interesting look at how different teams perform at different
stages of a match in league of legends; sadly I'm not much of a league
player so the nuances of choosing 15 minutes as a threshold / the
importance of dragons vs gold / etc are lost on me, but the analysis
strategy is pretty interesting and I enjoyed reading it. (Also reminded
me that I need to learn to implement k-fold cross validation)

[[https://arxiv.org/pdf/1708.05866.pdf][A Brief Survey of Deep
Reinforcement Learning]] Pretty cool survey paper. Got a kick out of "We
begin our survey of value-function-based DRL algorithms with the DQN, pictured in Figure 5, which achieved scores across a wide range of
classic Atari 2600 video games that were comparable to that of a
professional video games tester." (what does this even mean?)

[[https://www.gwern.net/docs/psychology/2016-levitt.pdf][HEADS OR TAILS:
THE IMPACT OF A COIN TOSS ON MAJOR LIFE DECISIONS AND SUBSEQUENT
HAPPINESS]] People who make changes report being much happier 2-6 months
later, even when the choice to make that decision was completely random.
"The results of this paper suggest that people may be excessively
cautious when facing life changing choices".

[[http://web.archive.org/web/20091026234156/http://geocities.com/currintrading/][Currin
Trading - Ambition, Deception, Honor, Redemption: The story of the
biggest heist in Eve's history]] Half chilling, half fascinating - Eve
Online scammer details how he ran a ponzi scheme disguised as a
fraudulent trading corporation in-game, eventually leading to him making
away with 30 billion isk (A few thousand dollars). There's a lot of
really amusing anecdotes in here (he claims he didn't sell the isk for
real money because he didn't want to break the terms of service, he
mentions the playerbase revolting after the moderators returned money
from a different scam, and that he had intended to return as much of it
as possible before being mistakenly banned and changing his mind upon
the reversal), and it reads like a wild criminal testimonial for someone
who knows he's not going to face any repercussions. In the end he blew
the whistle on another scammer, the EVE Interstellar Bank, a scam that
netted /that/ scammer 750 billion isk (~$80k USD).

"those who did not make specific requests, and instead asked open-ended
questions like "how can I trust you?" and "how do I know this is for
real?"--these were future investors. They were asking me to persuade
them. They wanted to believe."

"People who posted on the forums seemed to have a negative attitude
about everything. Rather than being a cross-section of the Eve populace,
the forums were populated by a group disparagingly known as "the forum
superstars"--people who spent all their time on the forums instead of
actually playing the game. Not only did they have a fame and influence
far out of proportion to their playing abilities, they were accused of
getting special treatment from the administrators of the Eve servers.
But it was their persistent scorn for anyone making anything new--and
their seeming inability to make their own positive contributions to the
game--that maintained the ordinary players' low regard for them."

"In the end, I decided that the only value in having stolen all of that
isk was not the isk itself, but the stealing of it. I wanted to see if I
could do the impossible, and I did it. The more I pondered the actual
value of isk, the more I saw that the only people who really valued it
were the ones who had earned it themselves. Despite Eve being a game,
they had put real work into it. Many of them had spent three years
shooting rocks and hauling modules around to earn that isk, and now it
would be gone."

"Only now did I appreciate just how insidious a scam could be. I had
thought the isk meant nothing to me. That it was just a means to an end,
a score to beat. But now I was willing to wreak devastation upon all of
my investors just to hold onto it. The scam had scammed me. It stole my
concern for others and replaced it with gluttony. I was disgusted. I
lied. I cheated people. I used people to help me scam their friends. I
was the cause of widespread bankruptcy. But the most damning thing of
all? I think I can live with it, and if I had it to do all over again, I
would. To my surprise, a guilty conscience was a small price to pay for
thirty billion isk. So I will learn to live with it, because I can live
with it."

***** Videos
     :PROPERTIES:
     :CUSTOM_ID: videos-1
     :END:

[[https://www.youtube.com/watch?v=v3O9vNi-dkA][Hear the Otherworldly
Sounds of Skating on Thin Ice | National Geographic]] Unsure if this is
more or less terrifying than that video of
[[https://www.youtube.com/watch?v=Phl82D57P58][Alex Hannold]]
free-soloing El Sendro Luminoso, but to be fair thin ice and heights are
my two greatest fears so perhaps it's just me.

[[https://www.youtube.com/watch?v=wwyznoWJDHI][Medieval Tune.
Hurdy-Gurdy With Organ]] Haunting

[[https://www.youtube.com/watch?v=jSxmZg-5Nxc][6LACK - Never Know]] If I
was waiting on you to tell me, then I would never know

--------------


*** January 2018
**** Goals for February
    :PROPERTIES:
    :CUSTOM_ID: goalsforfebruary
    :END:

-  SSBM: use solo practice time better, do a lot of set analysis /
   notetaking especially vs marth and sheik, work on implementing better
   control over aerial drift
-  Site: make site more mobile friendly, write scripts to manage a bunch
   of pages at once
-  Write one article, make one video, read four books

**** Updates
    :PROPERTIES:
    :CUSTOM_ID: updates
    :END:

-  Tentatively added Disqus comments to my writings - fully prepared to
   reevaluate this later and conclude it was a bad idea but I've been
   meaning to have a means of people sharing their ideas with me without
   needing to contact me on social media so this seems like a worthy try
-  also added google analytics, which I did not do before my statistics
   post and kicked myself for - it'll be useful to check what kind of
   audience I have for everything
-  Couldn't think of use for Raspberry Pi, Didn't get around to adding
   RSS, met all other goals for month and completed four books (!)

**** Stuff I've Made
     :PROPERTIES:
     :CUSTOM_ID: stuffivemade
     :END:

