links.html

<div id="outline-container-articles-1" class="outline-6">
<h6 id="articles-1"><a id="sec-1-2-11-4-1-1" name="sec-1-2-11-4-1-1"></a>Articles</h6>
<div class="outline-text-6" id="text-articles-1">

<p>
<a href="http://oracleselixir.com/2015/10/egr-and-mlr-new-team-ratings/">EGR
AND MLR: NEW TEAM RATINGS</a> Shown to me by Shi Deng of Big Blue esports.
A pretty interesting look at how different teams perform at different
stages of a match in league of legends; sadly I'm not much of a league
player so the nuances of choosing 15 minutes as a threshold / the
importance of dragons vs gold / etc are lost on me, but the analysis
strategy is pretty interesting and I enjoyed reading it. (Also reminded
me that I need to learn to implement k-fold cross validation)
</p>

<p>
<a href="https://arxiv.org/pdf/1708.05866.pdf">A Brief Survey of Deep
Reinforcement Learning</a> Pretty cool survey paper. Got a kick out of "We
begin our survey of value-function-based DRL algorithms with the DQN, pictured in Figure 5, which achieved scores across a wide range of
classic Atari 2600 video games that were comparable to that of a
professional video games tester." (what does this even mean?)
</p>

<p>
<a href="https://www.gwern.net/docs/psychology/2016-levitt.pdf">HEADS OR TAILS:
THE IMPACT OF A COIN TOSS ON MAJOR LIFE DECISIONS AND SUBSEQUENT
HAPPINESS</a> People who make changes report being much happier 2-6 months
later, even when the choice to make that decision was completely random.
"The results of this paper suggest that people may be excessively
cautious when facing life changing choices".
</p>

<p>
<a href="http://web.archive.org/web/20091026234156/http://geocities.com/currintrading/">Currin
Trading - Ambition, Deception, Honor, Redemption: The story of the
biggest heist in Eve's history</a> Half chilling, half fascinating - Eve
Online scammer details how he ran a ponzi scheme disguised as a
fraudulent trading corporation in-game, eventually leading to him making
away with 30 billion isk (A few thousand dollars). There's a lot of
really amusing anecdotes in here (he claims he didn't sell the isk for
real money because he didn't want to break the terms of service, he
mentions the playerbase revolting after the moderators returned money
from a different scam, and that he had intended to return as much of it
as possible before being mistakenly banned and changing his mind upon
the reversal), and it reads like a wild criminal testimonial for someone
who knows he's not going to face any repercussions. In the end he blew
the whistle on another scammer, the EVE Interstellar Bank, a scam that
netted <i>that</i> scammer 750 billion isk (~$80k USD).
</p>

<p>
"those who did not make specific requests, and instead asked open-ended
questions like "how can I trust you?" and "how do I know this is for
real?"&#x2013;these were future investors. They were asking me to persuade
them. They wanted to believe."
</p>

<p>
"People who posted on the forums seemed to have a negative attitude
about everything. Rather than being a cross-section of the Eve populace,
the forums were populated by a group disparagingly known as "the forum
superstars"&#x2013;people who spent all their time on the forums instead of
actually playing the game. Not only did they have a fame and influence
far out of proportion to their playing abilities, they were accused of
getting special treatment from the administrators of the Eve servers.
But it was their persistent scorn for anyone making anything new&#x2013;and
their seeming inability to make their own positive contributions to the
game&#x2013;that maintained the ordinary players' low regard for them."
</p>

<p>
"In the end, I decided that the only value in having stolen all of that
isk was not the isk itself, but the stealing of it. I wanted to see if I
could do the impossible, and I did it. The more I pondered the actual
value of isk, the more I saw that the only people who really valued it
were the ones who had earned it themselves. Despite Eve being a game,
they had put real work into it. Many of them had spent three years
shooting rocks and hauling modules around to earn that isk, and now it
would be gone."
</p>

<p>
"Only now did I appreciate just how insidious a scam could be. I had
thought the isk meant nothing to me. That it was just a means to an end,
a score to beat. But now I was willing to wreak devastation upon all of
my investors just to hold onto it. The scam had scammed me. It stole my
concern for others and replaced it with gluttony. I was disgusted. I
lied. I cheated people. I used people to help me scam their friends. I
was the cause of widespread bankruptcy. But the most damning thing of
all? I think I can live with it, and if I had it to do all over again, I
would. To my surprise, a guilty conscience was a small price to pay for
thirty billion isk. So I will learn to live with it, because I can live
with it."
</p>
</div>
</div>
</div>

<div id="outline-container-videos-1" class="outline-5">
<h5 id="videos-1"><a id="sec-1-2-11-4-2" name="sec-1-2-11-4-2"></a>Videos</h5>
<div class="outline-text-5" id="text-videos-1">

<p>
<a href="https://www.youtube.com/watch?v=v3O9vNi-dkA">Hear the Otherworldly
Sounds of Skating on Thin Ice | National Geographic</a> Unsure if this is
more or less terrifying than that video of
<a href="https://www.youtube.com/watch?v=Phl82D57P58">Alex Hannold</a>
free-soloing El Sendro Luminoso, but to be fair thin ice and heights are
my two greatest fears so perhaps it's just me.
</p>

<p>
<a href="https://www.youtube.com/watch?v=wwyznoWJDHI">Medieval Tune.
Hurdy-Gurdy With Organ</a> Haunting
</p>

<p>
<a href="https://www.youtube.com/watch?v=jSxmZg-5Nxc">6LACK - Never Know</a> If I
was waiting on you to tell me, then I would never know
</p>

<hr  />
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-12" class="outline-3">
<h3 id="sec-1-2-12">January 2018</h3>
<div class="outline-text-3" id="text-1-2-12">
</div><div id="outline-container-goalsforfebruary" class="outline-4">
<h4 id="goalsforfebruary"><a id="sec-1-2-12-1" name="sec-1-2-12-1"></a>Goals for February</h4>
<div class="outline-text-4" id="text-goalsforfebruary">

<ul class="org-ul">
<li>SSBM: use solo practice time better, do a lot of set analysis /
notetaking especially vs marth and sheik, work on implementing better
control over aerial drift
</li>
<li>Site: make site more mobile friendly, write scripts to manage a bunch
of pages at once
</li>
<li>Write one article, make one video, read four books
</li>
</ul>
</div>
</div>

<div id="outline-container-updates" class="outline-4">
<h4 id="updates"><a id="sec-1-2-12-2" name="sec-1-2-12-2"></a>Updates</h4>
<div class="outline-text-4" id="text-updates">

<ul class="org-ul">
<li>Tentatively added Disqus comments to my writings - fully prepared to
reevaluate this later and conclude it was a bad idea but I've been
meaning to have a means of people sharing their ideas with me without
needing to contact me on social media so this seems like a worthy try
</li>
<li>also added google analytics, which I did not do before my statistics
post and kicked myself for - it'll be useful to check what kind of
audience I have for everything
</li>
<li>Couldn't think of use for Raspberry Pi, Didn't get around to adding
RSS, met all other goals for month and completed four books (!)
</li>
</ul>
</div>
</div>
