org/links.org
***** Writing
     :PROPERTIES:
     :CUSTOM_ID: writing
     :END:

[[http://planetbanatt.net/articles/ambistats.html][Making Sense of
Melee: The Illusion of Objective Ranks and the Real Impact of
Everything]] The culmination of my most recent long-term Melee Stats
project where I gathered tons of tournament sets and examined trends in
the data - I used this data for seeding and for my SSBMRank Ballot, and
this post details my further scrutinizing of the patterns within. The
post got a lot more attention than I was expecting! (It got something
like 56k views if my rough, then-poor analytics are to be trusted).
Somebody posted it to
[[https://news.ycombinator.com/item?id=16255910][Hacker News]] where it
ended up reaching #6, and it got tons of shares on
[[https://twitter.com/Ambisinister_/status/957830089110147072][Twitter]].
I was very pleased that people were so excited about it, and ended up in
a surreal daze after seeing
[[https://twitter.com/gwern/status/958125156525858816][Gwern]] make a
tweet about Claude Bloodgood the same day.

***** Images
     :PROPERTIES:
     :CUSTOM_ID: images
     :END:

[[https://www.reddit.com/r/SSBM/comments/7rbxeg/assessing_west_coast_bias_on_ssbmrank_and_why_it/][SSBMRank
Voting Distribution Visualization for KayBeats' "Assessing West Coast
Bias on SSBMRank and Why it Doesn't Exist"]] KayB is a Melee Stats
denizen, and he wrote a post exploring the supposed "West Coast Bias" in
the SSBMRank panel. I collabed with him by generating
[[https://imgur.com/a/jUfST][Violin Plots]] (boxplots with kernel
density plots overlayed on top of them) of the top 100 ballots,
graciously provided by Tafokints.

**** Stuff I've consumed
     :PROPERTIES:
     :CUSTOM_ID: stuffiveconsumed
     :END:

***** Papers
     :PROPERTIES:
     :CUSTOM_ID: papers
     :END:

[[http://academic.udayton.edu/JackBauer/Readings%20353/Bonanno%2004%20resilience.pdf][Loss,
Trauma, and Human Resilience - Have We Underestimated the Human Capacity
to Thrive After Extremely Aversive Events?]] A surprisingly optimistic
paper which suggests that most people are actually impressively
resilient after aversive events. Because so many people that show up to
clinicians after bad things happen are in need of clinicians to help
them, the prevailing view was that when bad things happen to people they
usually need time to grieve. However, the sample size was very
self-selecting here, and exploring more "normal" baselines suggest its
possible that on average people are pretty good about staying functional
through traumatic events.

[[http://www.nber.org/papers/w17639.pdf][SELECTING THE BEST? SPILLOVER
AND SHADOWS IN ELIMINATION TOURNAMENTS]]

[[https://www.hri.global/files/2011/07/13/Benowitz_-_Nicotine_Regulation.pdf][Establishing
a Nicotine Threshold for Addiction -- The Implications for Tobacco
Regulation]] I am not a smoker, but I was met with the idle question of
how many cigarettes one would have to smoke daily to become addicted.
The threshold seems to be around 5mg per day, which ends up being
something like 5 cigarettes.

***** Books
     :PROPERTIES:
     :CUSTOM_ID: books
     :END:

[[https://www.goodreads.com/book/show/18713259-worm?ac=1&from_search=true][Worm]]
by wildbow Great min/maxing fantasy-scifi story, full thoughts
[[https://www.goodreads.com/review/show/2054020916?book_show_action=false&from_review_page=1][here]].

[[https://www.goodreads.com/book/show/36595101-fire-and-fury][Fire and
Fury]] Likely a little exaggerated for effect, but a truly wild hit
piece that reads more like fiction than reality, full thoughts
[[https://www.goodreads.com/review/show/2246424359][here]]

[[https://www.goodreads.com/book/show/24724602-flash-boys][Flash Boys: A
Wall Street Revolt]] Cool book that I should have read a lot sooner and
one I'd immediately recommend to someone that wants to know about how my
current field works - full thoughts
[[https://www.goodreads.com/review/show/2277393546][here]]

[[https://www.goodreads.com/book/show/11297.Norwegian_Wood][Norwegian
Wood]] This book was extremely painful to read and made me sad for three
days, would recommend. Full thoughts
[[https://www.goodreads.com/review/show/2279855880?book_show_action=false][here]]

***** Media
     :PROPERTIES:
     :CUSTOM_ID: media
     :END:

[[http://mangakakalot.com/manga/love_is_blind_fujimoto_tatsuki][Love is
Blind - Fujimoto Tatsuki]] amazingly funny oneshot

[[https://www.youtube.com/watch?v=O3eO646jjzQ][Professional Scrabble
Players Replay Their Greatest Moves | The New Yorker]]

[[https://www.youtube.com/watch?v=Z9e7K6Hx_rY][Rex Orange County -
Sunflower]]

--------------


** 2017
   :PROPERTIES:
   :CUSTOM_ID: section
   :END:

*** Year End 2017
    :PROPERTIES:
    :CUSTOM_ID: yearend2017
    :END:

**** Goals for January
    :PROPERTIES:
    :CUSTOM_ID: goalsforjanuary
    :END:

-  Build something interesting with the Raspberry Pi 3 kit I got for
   Christmas, use Amazon Gift Cards to buy assorted things if need be
-  I've made very good progress on my more recent melee stats project
   and expect to be finished very shortly - the only reason I could
   imagine it taking longer than end of January is incorporation of top
   100 data for further analysis
-  learn a bunch of slow cooker recipes
-  Work on the infrastructure of this website - Maybe add Disqus
   comments, an RSS feed, make it slightly nicer looking

**** Stuff I've Made
     :PROPERTIES:
     :CUSTOM_ID: stuffivemade
     :END:

***** Writing
     :PROPERTIES:
     :CUSTOM_ID: writing
     :END:

[[http://planetbanatt.net/articles/360view.html][/Seeing Everything: A
Visual Perception Experiment Proposal/]] Not really a /project/ per-se,
more like a "man, somebody should do this" idea that I've had for a
while that just won't really leave my head.

***** Videos
     :PROPERTIES:
     :CUSTOM_ID: videos
     :END:

[[https://youtu.be/1jp0Q2KWi-E][Downwait Instant Ledgegrab]] An attempt
to make my videos a bit more visually appealing without sacrificing the
content or the conciseness: I rarely feel that these sorts of demos
warrant more than a 60 second video and I would like my content to
remain highly valuable per unit time, but if I can put a bit of extra
effort into them and have them be more polished without sacrificing this
then I don't think there's any reason not to.

***** Images
     :PROPERTIES:
     :CUSTOM_ID: images
     :END:

[[https://twitter.com/Ambisinister_/status/939963464180752386][How Good
is Melee National Seeding?]] Melee Stats group does it better

**** Stuff I've Consumed
     :PROPERTIES:
     :CUSTOM_ID: stuffiveconsumed
     :END:

