links.html

<div id="outline-container-stuffivemade" class="outline-4">
<h4 id="stuffivemade"><a id="sec-1-2-12-3" name="sec-1-2-12-3"></a>Stuff I've Made</h4>
<div class="outline-text-4" id="text-stuffivemade">
</div>

<div id="outline-container-writing" class="outline-5">
<h5 id="writing"><a id="sec-1-2-12-3-1" name="sec-1-2-12-3-1"></a>Writing</h5>
<div class="outline-text-5" id="text-writing">

<p>
<a href="http://planetbanatt.net/articles/ambistats.html">Making Sense of
Melee: The Illusion of Objective Ranks and the Real Impact of
Everything</a> The culmination of my most recent long-term Melee Stats
project where I gathered tons of tournament sets and examined trends in
the data - I used this data for seeding and for my SSBMRank Ballot, and
this post details my further scrutinizing of the patterns within. The
post got a lot more attention than I was expecting! (It got something
like 56k views if my rough, then-poor analytics are to be trusted).
Somebody posted it to
<a href="https://news.ycombinator.com/item?id=16255910">Hacker News</a> where it
ended up reaching #6, and it got tons of shares on
<a href="https://twitter.com/Ambisinister_/status/957830089110147072">Twitter</a>.
I was very pleased that people were so excited about it, and ended up in
a surreal daze after seeing
<a href="https://twitter.com/gwern/status/958125156525858816">Gwern</a> make a
tweet about Claude Bloodgood the same day.
</p>
</div>
</div>

<div id="outline-container-images" class="outline-5">
<h5 id="images"><a id="sec-1-2-12-3-2" name="sec-1-2-12-3-2"></a>Images</h5>
<div class="outline-text-5" id="text-images">

<p>
<a href="https://www.reddit.com/r/SSBM/comments/7rbxeg/assessing_west_coast_bias_on_ssbmrank_and_why_it/">SSBMRank
Voting Distribution Visualization for KayBeats' "Assessing West Coast
Bias on SSBMRank and Why it Doesn't Exist"</a> KayB is a Melee Stats
denizen, and he wrote a post exploring the supposed "West Coast Bias" in
the SSBMRank panel. I collabed with him by generating
<a href="https://imgur.com/a/jUfST">Violin Plots</a> (boxplots with kernel
density plots overlayed on top of them) of the top 100 ballots,
graciously provided by Tafokints.
</p>
</div>
</div>
</div>

<div id="outline-container-stuffiveconsumed" class="outline-4">
<h4 id="stuffiveconsumed"><a id="sec-1-2-12-4" name="sec-1-2-12-4"></a>Stuff I've consumed</h4>
<div class="outline-text-4" id="text-stuffiveconsumed">
</div>

<div id="outline-container-papers" class="outline-5">
<h5 id="papers"><a id="sec-1-2-12-4-1" name="sec-1-2-12-4-1"></a>Papers</h5>
<div class="outline-text-5" id="text-papers">

<p>
<a href="http://academic.udayton.edu/JackBauer/Readings%20353/Bonanno%2004%20resilience.pdf">Loss,
Trauma, and Human Resilience - Have We Underestimated the Human Capacity
to Thrive After Extremely Aversive Events?</a> A surprisingly optimistic
paper which suggests that most people are actually impressively
resilient after aversive events. Because so many people that show up to
clinicians after bad things happen are in need of clinicians to help
them, the prevailing view was that when bad things happen to people they
usually need time to grieve. However, the sample size was very
self-selecting here, and exploring more "normal" baselines suggest its
possible that on average people are pretty good about staying functional
through traumatic events.
</p>

<p>
<a href="http://www.nber.org/papers/w17639.pdf">SELECTING THE BEST? SPILLOVER
AND SHADOWS IN ELIMINATION TOURNAMENTS</a>
</p>

<p>
<a href="https://www.hri.global/files/2011/07/13/Benowitz_-_Nicotine_Regulation.pdf">Establishing
a Nicotine Threshold for Addiction &#x2013; The Implications for Tobacco
Regulation</a> I am not a smoker, but I was met with the idle question of
how many cigarettes one would have to smoke daily to become addicted.
The threshold seems to be around 5mg per day, which ends up being
something like 5 cigarettes.
</p>
</div>
</div>

<div id="outline-container-books" class="outline-5">
<h5 id="books"><a id="sec-1-2-12-4-2" name="sec-1-2-12-4-2"></a>Books</h5>
<div class="outline-text-5" id="text-books">

<p>
<a href="https://www.goodreads.com/book/show/18713259-worm?ac=1&from_search=true">Worm</a>
by wildbow Great min/maxing fantasy-scifi story, full thoughts
<a href="https://www.goodreads.com/review/show/2054020916?book_show_action=false&from_review_page=1">here</a>.
</p>

<p>
<a href="https://www.goodreads.com/book/show/36595101-fire-and-fury">Fire and
Fury</a> Likely a little exaggerated for effect, but a truly wild hit
piece that reads more like fiction than reality, full thoughts
<a href="https://www.goodreads.com/review/show/2246424359">here</a>
</p>

<p>
<a href="https://www.goodreads.com/book/show/24724602-flash-boys">Flash Boys: A
Wall Street Revolt</a> Cool book that I should have read a lot sooner and
one I'd immediately recommend to someone that wants to know about how my
current field works - full thoughts
<a href="https://www.goodreads.com/review/show/2277393546">here</a>
</p>

<p>
<a href="https://www.goodreads.com/book/show/11297.Norwegian_Wood">Norwegian
Wood</a> This book was extremely painful to read and made me sad for three
days, would recommend. Full thoughts
<a href="https://www.goodreads.com/review/show/2279855880?book_show_action=false">here</a>
</p>
</div>
</div>

<div id="outline-container-media" class="outline-5">
<h5 id="media"><a id="sec-1-2-12-4-3" name="sec-1-2-12-4-3"></a>Media</h5>
<div class="outline-text-5" id="text-media">

<p>
<a href="http://mangakakalot.com/manga/love_is_blind_fujimoto_tatsuki">Love is
Blind - Fujimoto Tatsuki</a> amazingly funny oneshot
</p>

<p>
<a href="https://www.youtube.com/watch?v=O3eO646jjzQ">Professional Scrabble
Players Replay Their Greatest Moves | The New Yorker</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=Z9e7K6Hx_rY">Rex Orange County -
Sunflower</a>
</p>

<hr  />
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-section" class="outline-2">
<h2 id="section"><a id="sec-1-3" name="sec-1-3"></a>2017</h2>
<div class="outline-text-2" id="text-section">
</div>

<div id="outline-container-yearend2017" class="outline-3">
<h3 id="yearend2017"><a id="sec-1-3-1" name="sec-1-3-1"></a>Year End 2017</h3>
<div class="outline-text-3" id="text-yearend2017">
</div>

<div id="outline-container-goalsforjanuary" class="outline-4">
<h4 id="goalsforjanuary"><a id="sec-1-3-1-1" name="sec-1-3-1-1"></a>Goals for January</h4>
<div class="outline-text-4" id="text-goalsforjanuary">

<ul class="org-ul">
<li>Build something interesting with the Raspberry Pi 3 kit I got for
Christmas, use Amazon Gift Cards to buy assorted things if need be
</li>
<li>I've made very good progress on my more recent melee stats project
and expect to be finished very shortly - the only reason I could
imagine it taking longer than end of January is incorporation of top
100 data for further analysis
</li>
<li>learn a bunch of slow cooker recipes
</li>
<li>Work on the infrastructure of this website - Maybe add Disqus
comments, an RSS feed, make it slightly nicer looking
</li>
</ul>
</div>
</div>

<div id="outline-container-stuffivemade" class="outline-4">
<h4 id="stuffivemade"><a id="sec-1-3-1-2" name="sec-1-3-1-2"></a>Stuff I've Made</h4>
<div class="outline-text-4" id="text-stuffivemade">
</div>

<div id="outline-container-writing" class="outline-5">
<h5 id="writing"><a id="sec-1-3-1-2-1" name="sec-1-3-1-2-1"></a>Writing</h5>
<div class="outline-text-5" id="text-writing">

<p>
<a href="http://planetbanatt.net/articles/360view.html"><i>Seeing Everything: A
Visual Perception Experiment Proposal</i></a> Not really a <i>project</i> per-se,
more like a "man, somebody should do this" idea that I've had for a
while that just won't really leave my head.
</p>
</div>
</div>

<div id="outline-container-videos" class="outline-5">
<h5 id="videos"><a id="sec-1-3-1-2-2" name="sec-1-3-1-2-2"></a>Videos</h5>
<div class="outline-text-5" id="text-videos">

<p>
<a href="https://youtu.be/1jp0Q2KWi-E">Downwait Instant Ledgegrab</a> An attempt
to make my videos a bit more visually appealing without sacrificing the
content or the conciseness: I rarely feel that these sorts of demos
warrant more than a 60 second video and I would like my content to
remain highly valuable per unit time, but if I can put a bit of extra
effort into them and have them be more polished without sacrificing this
then I don't think there's any reason not to.
</p>
</div>
</div>

<div id="outline-container-images" class="outline-5">
<h5 id="images"><a id="sec-1-3-1-2-3" name="sec-1-3-1-2-3"></a>Images</h5>
<div class="outline-text-5" id="text-images">

<p>
<a href="https://twitter.com/Ambisinister_/status/939963464180752386">How Good
is Melee National Seeding?</a> Melee Stats group does it better
</p>
</div>
</div>
</div>
