org/links.org
***** Articles
     :PROPERTIES:
     :CUSTOM_ID: articles
     :END:

[[https://arxiv.org/pdf/1712.01815.pdf][Mastering Chess and Shogi by
Self-Play with a General Reinforcement Learning Algorithm]] A wonderful
paper that appeals to my AI and Chess-playing selves - Deepmind plays
beautifully even with no input from humans whatsoever.

[[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3001541/][Cigarette
smoking: an underused tool in high-performance endurance training]] An
incredible, hilarious paper that I plan on linking people frequently in
the future - from the abstract: /"However, if research results are
selectively chosen, a review has the potential to create a convincing
argument for a faulty hypothesis. Improper correlation or extrapolation
of data can result in dangerously flawed conclusions. The following
paper seeks to illustrate this point, using existing research to argue
the hypothesis that cigarette smoking enhances endurance performance and
should be incorporated into high-level training programs."/

[[http://kadano.net/SSBM/inputlag/][Kadano on Input Lag]] Running Dan
Salvato's polling fix code on console improves input delay by a bit
below 12ms, as measured with an Oscilloscope. Overall a great read on
Input Lag in general.

[[http://bearlamp.com.au/how-i-accidentally-discovered-the-pill-to-enlightenment-but-i-wouldnt-recommend-it/][How
I accidentally discovered the pill to enlightenment but I wouldn't
recommend it.]] Cool writeup I got from a member of the ssc discord, a
cool narrative version of a similar project to my health notes.

***** Media
     :PROPERTIES:
     :CUSTOM_ID: media
     :END:

[[http://slatestarcodex.com/2015/06/02/and-i-show-you-how-deep-the-rabbit-hole-goes/][...And
I Show You How Deep The Rabbit Hole Goes]] I reread this and man do I
love it

[[http://unremediatedgender.space/2018/Jan/blame-me-for-trying/][Blame
Me For Trying]] Cool short scifi story loosely based on
[[https://en.wikipedia.org/wiki/ELIZA][ELIZA]], a classic NLP chatbot
that simulates a psychotherapist.

[[https://www.youtube.com/watch?v=9P8C6-XqaNs][Failing - A very
difficult piece for solo string bass]] Music as performance art,
examining the construct of difficulty and about the paradox of having a
goal of failure.

**** "Resolutions"
    :PROPERTIES:
    :CUSTOM_ID: resolutions
    :END:

I generally dislike "New Years Resolutions" but I think keeping myself
accountable for the things I want to accomplish over long periods of
time is pretty important. As 2018 is the first year I will be completely
operating without educational institutions to hand me goals (weird) I
feel it is more important to have a clear vision of my long-term goals.

-  Read 30 books
-  Write 15 longform posts on this website, not including links posts
-  Reach a point where creating a Patreon wouldn't be an embarrassing
   idea, create a Patreon, get at least three Patrons
-  become the fittest I have ever been

--------------

*** September 2017
    :PROPERTIES:
    :CUSTOM_ID: sept2017
    :END:

**** Goals for October
    :PROPERTIES:
    :CUSTOM_ID: goalsforoctober
    :END:

-  Move into an apartment, figure out general living / exercise / etc
   arrangements there
-  Figure out a good way to do rankings with the big SSBM dataset (~22k
   sets), write up more extensive analysis, mostly complete this project
-  Place well at The Big House 7, record a lot of sets for review later
-  Learn Keras / Deep Learning stuff and do a project with it
-  Complete reading GEB

**** Things I've Made
     :PROPERTIES:
     :CUSTOM_ID: thingsivemade
     :END:

***** Writing
     :PROPERTIES:
     :CUSTOM_ID: writing
     :END:

/[[http://planetbanatt.net/articles/potbonus.html][Do Pot Bonuses Affect
Entrant Numbers at Melee Tournaments?]]/ (short answer: no)

/[[http://planetbanatt.net/articles/random20xx.html][20XX 4.06 Savestate
Workflow in Dolphin]]/ Not a perfect solution but if I'm hoping if this
is written then somebody will improve upon it and it'll be amazing to
practice with.

***** Videos
     :PROPERTIES:
     :CUSTOM_ID: videos
     :END:

/[[https://www.youtube.com/watch?v=xD20oBJnAS8&feature=youtu.be][Understanding
Luigi's Ledgedashes]]/

/[[https://youtu.be/JCyHqiLimM4][Super Portable Recording Setup]]/ This
thing is amazing and I'm glad I bought it.

/[[https://www.youtube.com/watch?v=2BBE9I7genw][Tech You Should Already
Know - Spotdodge / Amsah Tech Option Select]]/ Habit I wanna pick up
during spotdodges, tested and verified idea I had a million years ago
working on my notes for the fox-sheik matchup.

***** Images
     :PROPERTIES:
     :CUSTOM_ID: images
     :END:

/[[https://twitter.com/ambisinister_/status/904469847794483203][Understanding
Fox Antiair Hitboxes]]/

/[[https://twitter.com/Ambisinister_/status/913580629996064768][The
Local is Dying]]/, in which I examine the attendance at SSBM local
tournaments and determine that attendance is roughly the same as 2016

**** Things I've Consumed
     :PROPERTIES:
     :CUSTOM_ID: thingsiveconsumed
     :END:

***** Interesting things I've committed to anki cards this month
     :PROPERTIES:
     :CUSTOM_ID: interestingthingsivecommittedtoankicardsthismonth
     :END:

-  Different types of cuts in cooking
-  [[https://docs.google.com/spreadsheets/d/1yIZuPIC5tCim159zb-ihQNTL88sOE2eMchTIz2wkt8Y/edit#gid=34872173][Aerial
   Advantage numbers for Melee]]
-  [[http://www.hsquizbowl.org/db/questionsets/747/][2014 Introductory
   Collaborative Collegiate Set, rounds 1-5]]
-  If I knew the answer somewhere, I'd add the fact before the one I
   knew. If I didn't know the answer, I'd make a more detailed card
   about it. For bonuses I'd just add it unless I was certain I didn't
   care enough to memorize it (usually opera or trash questions)
-  [[https://www.cdc.gov/ncbddd/hearingloss/parentsguide/download/fingerspelling.pdf][ASL
   Fingerspelling]]

***** Books
     :PROPERTIES:
     :CUSTOM_ID: books
     :END:

[[http://www.guidetojapanese.org/learn/grammar][Tae Kim's Guide to
Japanese Grammar]] feels like a pretty comprehensive collection of
grammar points in the Japanese language, and I suspect I will frequently
go back and read through this if I forget something or if I encounter a
grammatical structure that I am unfamiliar with. I really appreciated
the structure and despite it being a little wonky at first it made the
rest of the guide pretty simple to understand since everything made some
sense from a Japanese-speaking perspective rather than an
English-speaking one imposed upon the Japanese language. Gonna start
working through Genki I now that I've gotten through this book.

