links.html

<div id="outline-container-stuffiveconsumed" class="outline-4">
<h4 id="stuffiveconsumed"><a id="sec-1-3-1-3" name="sec-1-3-1-3"></a>Stuff I've Consumed</h4>
<div class="outline-text-4" id="text-stuffiveconsumed">
</div>

<div id="outline-container-articles" class="outline-5">
<h5 id="articles"><a id="sec-1-3-1-3-1" name="sec-1-3-1-3-1"></a>Articles</h5>
<div class="outline-text-5" id="text-articles">

<p>
<a href="https://arxiv.org/pdf/1712.01815.pdf">Mastering Chess and Shogi by
Self-Play with a General Reinforcement Learning Algorithm</a> A wonderful
paper that appeals to my AI and Chess-playing selves - Deepmind plays
beautifully even with no input from humans whatsoever.
</p>

<p>
<a href="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3001541/">Cigarette
smoking: an underused tool in high-performance endurance training</a> An
incredible, hilarious paper that I plan on linking people frequently in
the future - from the abstract: /"However, if research results are
selectively chosen, a review has the potential to create a convincing
argument for a faulty hypothesis. Improper correlation or extrapolation
of data can result in dangerously flawed conclusions. The following
paper seeks to illustrate this point, using existing research to argue
the hypothesis that cigarette smoking enhances endurance performance and
should be incorporated into high-level training programs."/
</p>

<p>
<a href="http://kadano.net/SSBM/inputlag/">Kadano on Input Lag</a> Running Dan
Salvato's polling fix code on console improves input delay by a bit
below 12ms, as measured with an Oscilloscope. Overall a great read on
Input Lag in general.
</p>

<p>
<a href="http://bearlamp.com.au/how-i-accidentally-discovered-the-pill-to-enlightenment-but-i-wouldnt-recommend-it/">How
I accidentally discovered the pill to enlightenment but I wouldn't
recommend it.</a> Cool writeup I got from a member of the ssc discord, a
cool narrative version of a similar project to my health notes.
</p>
</div>
</div>

<div id="outline-container-media" class="outline-5">
<h5 id="media"><a id="sec-1-3-1-3-2" name="sec-1-3-1-3-2"></a>Media</h5>
<div class="outline-text-5" id="text-media">

<p>
<a href="http://slatestarcodex.com/2015/06/02/and-i-show-you-how-deep-the-rabbit-hole-goes/">&#x2026;And
I Show You How Deep The Rabbit Hole Goes</a> I reread this and man do I
love it
</p>

<p>
<a href="http://unremediatedgender.space/2018/Jan/blame-me-for-trying/">Blame
Me For Trying</a> Cool short scifi story loosely based on
<a href="https://en.wikipedia.org/wiki/ELIZA">ELIZA</a>, a classic NLP chatbot
that simulates a psychotherapist.
</p>

<p>
<a href="https://www.youtube.com/watch?v=9P8C6-XqaNs">Failing - A very
difficult piece for solo string bass</a> Music as performance art,
examining the construct of difficulty and about the paradox of having a
goal of failure.
</p>
</div>
</div>
</div>

<div id="outline-container-resolutions" class="outline-4">
<h4 id="resolutions"><a id="sec-1-3-1-4" name="sec-1-3-1-4"></a>"Resolutions"</h4>
<div class="outline-text-4" id="text-resolutions">

<p>
I generally dislike "New Years Resolutions" but I think keeping myself
accountable for the things I want to accomplish over long periods of
time is pretty important. As 2018 is the first year I will be completely
operating without educational institutions to hand me goals (weird) I
feel it is more important to have a clear vision of my long-term goals.
</p>

<ul class="org-ul">
<li>Read 30 books
</li>
<li>Write 15 longform posts on this website, not including links posts
</li>
<li>Reach a point where creating a Patreon wouldn't be an embarrassing
idea, create a Patreon, get at least three Patrons
</li>
<li>become the fittest I have ever been
</li>
</ul>

<hr  />
</div>
</div>
</div>

<div id="outline-container-sept2017" class="outline-3">
<h3 id="sept2017"><a id="sec-1-3-2" name="sec-1-3-2"></a>September 2017</h3>
<div class="outline-text-3" id="text-sept2017">
</div>

<div id="outline-container-goalsforoctober" class="outline-4">
<h4 id="goalsforoctober"><a id="sec-1-3-2-1" name="sec-1-3-2-1"></a>Goals for October</h4>
<div class="outline-text-4" id="text-goalsforoctober">

<ul class="org-ul">
<li>Move into an apartment, figure out general living / exercise / etc
arrangements there
</li>
<li>Figure out a good way to do rankings with the big SSBM dataset (~22k
sets), write up more extensive analysis, mostly complete this project
</li>
<li>Place well at The Big House 7, record a lot of sets for review later
</li>
<li>Learn Keras / Deep Learning stuff and do a project with it
</li>
<li>Complete reading GEB
</li>
</ul>
</div>
</div>

<div id="outline-container-thingsivemade" class="outline-4">
<h4 id="thingsivemade"><a id="sec-1-3-2-2" name="sec-1-3-2-2"></a>Things I've Made</h4>
<div class="outline-text-4" id="text-thingsivemade">
</div>

<div id="outline-container-writing" class="outline-5">
<h5 id="writing"><a id="sec-1-3-2-2-1" name="sec-1-3-2-2-1"></a>Writing</h5>
<div class="outline-text-5" id="text-writing">

<p>
<i><a href="http://planetbanatt.net/articles/potbonus.html">Do Pot Bonuses Affect
Entrant Numbers at Melee Tournaments?</a></i> (short answer: no)
</p>

<p>
<i><a href="http://planetbanatt.net/articles/random20xx.html">20XX 4.06 Savestate
Workflow in Dolphin</a></i> Not a perfect solution but if I'm hoping if this
is written then somebody will improve upon it and it'll be amazing to
practice with.
</p>
</div>
</div>

<div id="outline-container-videos" class="outline-5">
<h5 id="videos"><a id="sec-1-3-2-2-2" name="sec-1-3-2-2-2"></a>Videos</h5>
<div class="outline-text-5" id="text-videos">

<p>
<i><a href="https://www.youtube.com/watch?v=xD20oBJnAS8&feature=youtu.be">Understanding
Luigi's Ledgedashes</a></i>
</p>

<p>
<i><a href="https://youtu.be/JCyHqiLimM4">Super Portable Recording Setup</a></i> This
thing is amazing and I'm glad I bought it.
</p>

<p>
<i><a href="https://www.youtube.com/watch?v=2BBE9I7genw">Tech You Should Already
Know - Spotdodge / Amsah Tech Option Select</a></i> Habit I wanna pick up
during spotdodges, tested and verified idea I had a million years ago
working on my notes for the fox-sheik matchup.
</p>
</div>
</div>

<div id="outline-container-images" class="outline-5">
<h5 id="images"><a id="sec-1-3-2-2-3" name="sec-1-3-2-2-3"></a>Images</h5>
<div class="outline-text-5" id="text-images">

<p>
<i><a href="https://twitter.com/ambisinister_/status/904469847794483203">Understanding
Fox Antiair Hitboxes</a></i>
</p>

<p>
<i><a href="https://twitter.com/Ambisinister_/status/913580629996064768">The
Local is Dying</a></i>, in which I examine the attendance at SSBM local
tournaments and determine that attendance is roughly the same as 2016
</p>
</div>
</div>
</div>

<div id="outline-container-thingsiveconsumed" class="outline-4">
<h4 id="thingsiveconsumed"><a id="sec-1-3-2-3" name="sec-1-3-2-3"></a>Things I've Consumed</h4>
<div class="outline-text-4" id="text-thingsiveconsumed">
</div>

<div id="outline-container-interestingthingsivecommittedtoankicardsthismonth" class="outline-5">
<h5 id="interestingthingsivecommittedtoankicardsthismonth"><a id="sec-1-3-2-3-1" name="sec-1-3-2-3-1"></a>Interesting things I've committed to anki cards this month</h5>
<div class="outline-text-5" id="text-interestingthingsivecommittedtoankicardsthismonth">

<ul class="org-ul">
<li>Different types of cuts in cooking
</li>
<li><a href="https://docs.google.com/spreadsheets/d/1yIZuPIC5tCim159zb-ihQNTL88sOE2eMchTIz2wkt8Y/edit#gid=34872173">Aerial
Advantage numbers for Melee</a>
</li>
<li><a href="http://www.hsquizbowl.org/db/questionsets/747/">2014 Introductory
Collaborative Collegiate Set, rounds 1-5</a>
</li>
<li>If I knew the answer somewhere, I'd add the fact before the one I
knew. If I didn't know the answer, I'd make a more detailed card
about it. For bonuses I'd just add it unless I was certain I didn't
care enough to memorize it (usually opera or trash questions)
</li>
<li><a href="https://www.cdc.gov/ncbddd/hearingloss/parentsguide/download/fingerspelling.pdf">ASL
Fingerspelling</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-books" class="outline-5">
<h5 id="books"><a id="sec-1-3-2-3-2" name="sec-1-3-2-3-2"></a>Books</h5>
<div class="outline-text-5" id="text-books">

<p>
<a href="http://www.guidetojapanese.org/learn/grammar">Tae Kim's Guide to
Japanese Grammar</a> feels like a pretty comprehensive collection of
grammar points in the Japanese language, and I suspect I will frequently
go back and read through this if I forget something or if I encounter a
grammatical structure that I am unfamiliar with. I really appreciated
the structure and despite it being a little wonky at first it made the
rest of the guide pretty simple to understand since everything made some
sense from a Japanese-speaking perspective rather than an
English-speaking one imposed upon the Japanese language. Gonna start
working through Genki I now that I've gotten through this book.
</p>
</div>
</div>
