org/links.org
***** Video Games
     :PROPERTIES:
     :CUSTOM_ID: videogames
     :END:

[[http://store.steampowered.com/app/698780/agecheck][Doki Doki
Literature Club]] Dan Salvato's new studio put out this game this month,
and I played through it. The tl;dr on my thoughts is that this game
manages to be cliche in two genres and draws far too much inspiration
from creepypasta. Full thoughts [[./articles/ddlc.html][here]].

[[http://sm64hacks.com/hack.php?id=59][SM64: The Last Impact]] a fun
romhack that is technically interesting and has some cool ideas and fun
levels, but suffers enormously from difficulty curve irregularity / bugs
/ poor level design. I found myself frequently getting softlocked, dying
randomly due to weird level geometry problems, having issues with the
camera, etc, and I eventually made it a game to see how many stars I
could get by BLJing past walls instead of actually earning them. I had
fun with it, but I couldn't manage to 100% it because there were just
some stars that were so broken that I got too frustrated to continue
playing. It made me appreciate how relatively not broken the original
game was, and how important beta testing is for these sorts of games.

[[https://www.playbattlegrounds.com/main.pu][Playerunknown's
Battlegrounds]] A fun game to fool around with friends in, but not one I
think is particularly well-designed from an esports perspective.

***** Articles
     :PROPERTIES:
     :CUSTOM_ID: articles
     :END:

/[[https://www.wired.com/2017/08/the-hotel-hacker/][The Hotel Room
Hacker]]/ Crazy story

***** Papers
     :PROPERTIES:
     :CUSTOM_ID: papers
     :END:

/[[https://arxiv.org/pdf/1702.06230.pdf][Beating the World's Best at
Super Smash Brothers with Deep Reinforcement Learning]]/ I believe this
is a more updated version of the paper I mentioned last month, so I'm
putting it here.

/[[http://www.glicko.net/glicko/glicko2.pdf][Example of the Glicko-2
System]]/ I ran this on a database of 22k super smash brothers melee
tournament set results, after ELO gave me mediocre results. The results
were better than ELO but still not very good.

***** Videos
     :PROPERTIES:
     :CUSTOM_ID: videos-1
     :END:

/[[https://www.youtube.com/watch?v=Zpql4uegZao][Earth Wind & Fire,
September - Bass Clarinet Choir]]/

/[[https://www.youtube.com/watch?v=KmbRTgjn2VQ][Learn Modal Jazz in 12
minutes. (No kidding.)]]/ Man, I miss being really involved with music
like I was in high school - I might pick up a music theory textbook and
brush up on it.

/[[https://www.youtube.com/watch?v=PDAseJvCpvk][How to Learn Music
(Epistemology and Music in the Digital Age)]]/ I'm not crazy about
Malcolm Gladwell but this video I think is a really well-worded
depiction of learning skills in general. I've watched a bunch of Adam
Neely's videos and he strikes me as extremely well-read, I was impressed
by how interesting all of his videos were while still consistently being
about music each time.

/[[https://www.youtube.com/watch?v=4p9_GxicLlw][Legend of Zelda: Ocarina
of Time - All Dungeons, No Doors TAS]]/ Crazy

/[[https://www.youtube.com/watch?v=vmNh_Ney87Y][Matchup Breakdown - Fox
vs Luigi (Chillindude829)]]/ Watched this after playing a set at Shine
2017 against a luigi and realizing that I didn't have a firm
understanding of my goals in this matchup (shine doesn't lead to
anything, grab doesn't lead to anything, so what are you going for in
neutral against luigi? What's your gameplan? I ended up just going for
random hits and getting steamrolled). Takeaways: uptilt vs nairs, dash
attack is a common mixup situation (nair out jump out etc), usually
avoid midrange (close/far is good), Disjoints are good (uptilt, falling
upair). Being above luigi is very good. Empty drill into fullhop is
pretty good because you can punish grab attempts with falling upair.

/[[https://www.youtube.com/watch?v=-uO1XE2MSnc][A YouTube choir: the
history of the most viewed videos converted into sound]]/ Perfect blend
of Music, Math, Visualization, and Shitposting. I got a huge kick out of
the inclusion of "All I Want For Christmas Is You" which predictably
shot up every december and then didn't move for the rest of the year.

/[[https://www.youtube.com/watch?v=ChPO9yPOy8c]["Rewrite" Production
Vlog #6: Everything is Fucked Up]]/ This is one of those "Truth is
stranger than fiction" type of stories I struggle to wrap my head
around, and yet I actually believe. tl;dr these two are shooting a
documentary about a now-shut-down modded video game, and got in contact
with a reclusive developer "Magus" who moves into their apartment to
help them with the documentary. However, it turns out that the person
that claimed to be Magus was actually somebody impersonating Magus,
having done so for months and knowing intimate information that
"verified" their identity with other dev team members. Nobody knows who
this person was, or how they knew so much about Magus and the internal
details of the development team, and everybody is freaked out about it.

/[[https://www.youtube.com/watch?v=LeItHAxLg9w][Batman: The Dark Knight
Trilogy Cover - Pedrosaxo]]/ Guy plays a duet with himself, seems very
technically demanding. I don't play saxophone but what I'm vaguely sure
is going on here is he's using the same technique you use for circular
breathing in order to hum a note at the same time he produces a note on
his instrument, resulting in two notes being played. Very neat!

--------------

*** August 2017
    :PROPERTIES:
    :CUSTOM_ID: August2017
    :END:

**** Goals for September
    :PROPERTIES:
    :CUSTOM_ID: goals-for-september
    :END:

-  Finish Tae Kim Guide to Japanese (~75% complete) and move on to Genki
   I
-  Finish the books I'm currently reading, as well as GEB and the
   fast.ai MOOC
-  establish working demo of melee stats page, scrape at least 8000
   sets, learn enough webdev to get a working prototype complete by the
   end of the month
-  write draft for posts on spaced repetition, man vs AI publicity
   stunts, melee stats analysis
-  join a gym, begin resistance training, begin eating at a surplus
-  other potential project ideas: something with Keras (MP3 file -> osu
   map? Too much?), do pot bonuses boost attendance at melee
   tournaments?

**** Things I've made
     :PROPERTIES:
     :CUSTOM_ID: things-ive-made
     :END:

***** Writing:
     :PROPERTIES:
     :CUSTOM_ID: writing
     :END:

/[[./articles/health.html][Optimizing health with cronometer]]/ I hit my
weight goal, going to start resistance training next

/[[./articles/omron.html][How variable are Omron Scales]]/ Since I met
my weight goal I tested the variability of my scale a second time. If I
gain weight in a substantially lean way and get my old values for
bodyfat, I'll conclude that the scales results are useless. Otherwise,
I'll measure what it returns.

