org/links.org
***** Videos:
     :PROPERTIES:
     :CUSTOM_ID: videos
     :END:

/[[https://www.youtube.com/watch?v=UhDw-Q6nv5Y&feature=youtu.be&a][Using
Fox Lifesaver with Shine Stalls]]/ Video made to explore using shine
stall w/ conserving doublejump, also correcting for the 20 frame tap
jump buffer which KJH lists as 4f in his video

/[[https://www.youtube.com/watch?v=Ug4RvHKBZGs&feature=youtu.be][Samus
Hammer Throw Glitch]]/ Video of a sort of obscure glitch with Samus in
1.00, it's one of my favorite glitches and doesn't have a tutorial
anywhere, so I made one.

/Peach Q-Drop Pressure/ [[[https://twitter.com/Ambisinister%253Cem%253E/status/894236993554714624][1]]] [[[https://twitter.com/Ambisinister/status/894301430693195776][2]]]

**** Links
     :PROPERTIES:
     :CUSTOM_ID: links
     :END:

***** Blogposts, Web
     :PROPERTIES:
     :CUSTOM_ID: blogposts-web
     :END:

/OpenAI Dota 2 AI/ [[https://blog.openai.com/dota-2/][{1}]] [[https://blog.openai.com/more-on-dota-2/][{2}]] Not good enough at dota
to make an accurate assessment. Compare to Vlad "Xpilot" Firoiu's
[[https://dspace.mit.edu/bitstream/handle/1721.1/108984/986497700-MIT.pdf?sequence=1][master's
thesis at MIT]] Philip the Falcon Ditto AI, which
[[https://www.youtube.com/watch?v=dXJUlqBsZtE][can beat good players]];
as well as [[https://www.youtube.com/watch?v=9qWHM8DNdr8][SmashBot]],
which uses a hardcoded goals hierarchy rather than learning it all via
deep reinforcement learning. These fall under what I call "Watson
Syndrome" where they are capable of winning because of their superior
"biology" rather than actually outplaying their opponents, and as such I
don't think these are particularly useful as training tools (I.e. A
"winning position" for the AI is not necessarily winning for a human, if
such a situation requires something like frame perfect reaction time,
and attempting to emulate its playstyle would likely be extremely
foolish, unlike with Deep Blue or AlphaGo. For games with a biological
element [Melee, Dota, Jeopardy] emulating realistic biology is important
before you can announce "triumph" over human players.)

/[[http://www.genetickanji.com/grade1.asp][Genetickanji - Kanji Grade
1]]/ I've been doing five of these each day and have gone through a
little over 100 this month - I specifically wanted something reasonably
structured by radical / Mnemonic but with actual readings (which RTK did
not have - I have a copy of it and I'm using it for kanji I'm having
trouble with but as a method by itself it seems pretty terrible). Some
of the suggestions for remembering things in genetickanji are bad / big
stretches, but overall it's nicely structured and not too big a
commitment to figure out.

/[[https://twitter.com/ambisinister_/status/903323311089885185][Bet on
UCF not being at any majors]]/ I bet $10 with @uconnsdoom that UCF is
not present at Big House 7, Summit, Genesis, CEO, or EVO.

***** Papers
     :PROPERTIES:
     :CUSTOM_ID: papers
     :END:

/[[https://makegirlsmoe.github.io/assets/pdf/technical_report.pdf][Create
Anime Characters With A.I.! (Jin et al 2017)]]/ amazing / hilarious /
surprisingly straightforward, particularly enjoyed the section on
generating release-date-specific images ("as you can see from figure
5... the more recent images are cuter and higher quality")

/[[https://www.ncbi.nlm.nih.gov/m/pubmed/28742910/][Clinicopathological
Evaluation of Chronic Traumatic Encephalopathy in Players of American
Football (Mez et al 2017)]]/ Football is a moral evil and inherently
dangerous (half kidding). A somewhat self-selecting sample, but the
effect size is so large that this could be considered a huge blow to the
idea that "football is safe enough for children".

/[[https://arxiv.org/ftp/arxiv/papers/1707/1707.06643.pdf][Predicting
Personality from Book Preferences with User-Generated Content Labels
(Annalyn et al 2017)]]/ A cool paper exploring differences in
personality among people who enjoy certain genres of books, using
user-submitted tags on goodreads and declared preferences on facebook.
The visualization in this paper is excellent, and although I don't think
the paper's conclusion is that powerful (correlation between a
preference + big 5 feels pretty unimportant) I think the methodology was
great.

***** Books / Audiobooks
     :PROPERTIES:
     :CUSTOM_ID: books-audiobooks
     :END:

/Berlitz Complete Japanese/ A good series of dialogues to introduce
basic Japanese grammar (I'm still very much a beginner but I imagine
this is all N5 level). The dialogues are charming enough to keep you
reasonably engaged - I found myself more amused than I ought to be
listening to Harrison-san's antics, which I think is a good thing for
this type of resource. The dialogues are completely in Japanese, which
is what I wanted, but things become confusing if you can't figure out
what words mean so this might be worth supplementing with another
textbook, a dictionary, or the workbook. There's some weirdness
(pronouncing wo particle actually as "wo" sometimes) but overall good to
listen to if you want to practice listening/speaking

/Introductory Statistics with R/ A book that I think is best suited
either with a teacher or with another, more traditional, statistics
textbook. Using R has proven very useful, but the book was heavy with
jargon that it did not explain properly, and I frequently felt lost
despite making flashcards and reading very carefully. Certain concepts
are vaguely explained or not explained at all, and you're expected to
have a minimum level of knowledge that I felt was inappropriate given
that it also explained really basic stuff like factorials. Overall a
useful book that added a good tool to my toolkit, but one that
frequently had me googling things for clarification.

***** Manga
     :PROPERTIES:
     :CUSTOM_ID: manga
     :END:

/[[https://en.wikipedia.org/wiki/Aria_(manga)][Aria]]/ Slow, relaxing,
with some basic scifi concepts, works better as a manga than an anime
due to pacing. Fits the genre of "utopia that isn't a utopia", everyone
just sort of lazily goes about their days and most of the story is
literally about being able to slow down and admire the scenery around
you (MC's entire personality type, as well as the job of the Primas).

/[[https://www.gwern.net/Aria%27s%20past,%20present,%20and%20future][Aria's
Past, Present, and Future (Gwern)]]/ Hilarious, I've always had a soft
spot for violating suspension of disbelief and then trying to explain it
away using crazy theories. Reminds me a lot of the
"[[http://matrix.wikia.com/wiki/Matrix_in_a_Matrix_theory][Matrix in a
Matrix]]" theory, where people plugged the ridiculous left-field plot
hole of Matrix Reloaded as evidence that, since Neo can use powers in
the "real world", it's likely not the real world - just another layer of
fabrication that Neo pulled his punches in because he didn't believe he
had powers in there. Probably false, but a fun way to engage with plot
holes!

